{
  "exit_criteria": "Critères de sortie",
  "entry_criteria": "Critères d'entrée",
  "criterion.metrics-feedback-available": "Les informations issues des indicateurs et des commentaires sont disponibles pour optimiser les API existantes.",
  "criterion.business-goals-defined": "Les objectifs commerciaux sont définis.",
  "criterion.market-research-done": "Une étude de marché identifie les opportunités en matière d'API.",
  "criterion.stakeholder-approval": "Les parties prenantes approuvent les discussions stratégiques.",
  "criterion.api-opportunity-documented": "Les opportunités individuelles en matière d'API sont identifiées et documentées.",
  "criterion.api-reusability": "L'API répond à un besoin commercial clair et est réutilisable par plusieurs consommateurs d'API.",
  "criterion.hide-backend-discrepancies": "L'objectif de l'API est de masquer les modèles de données backend et les divergences.",
  "criterion.value-prop-validated": "La proposition de valeur est validée par les principales parties prenantes.",
  "criterion.consumer-segments-identified": "Les segments d'utilisateurs de l'API (internes et externes) sont identifiés.",
  "criterion.api-roadmap-defined": "Des feuilles de route de haut niveau pour le développement de l'API sont établies.",
  "criterion.architecture-patterns-validated": "L'architecture de l'API utilise des modèles qui favorisent la réutilisabilité et l'intégration, et est validée par les parties prenantes.",
  "criterion.design-reflects-business-value": "La conception et les points de terminaison de l'API ont un lien clair avec leur valeur commerciale et leurs fonctionnalités.",
  "criterion.api-consistency": "L'API a une conception cohérente avec nos autres produits API.",
  "criterion.api-contract-tested": "Le contrat API est testé et répond aux exigences fonctionnelles et non fonctionnelles.",
  "criterion.api-description-available": "L'API et ses points de terminaison sont accompagnés de descriptions qui expliquent leur valeur commerciale et leurs fonctionnalités.",
  "criterion.audit-passed": "L'API passe avec succès les contrôles de conformité, de sécurité et d'audit.",
  "criterion.audit-reports-shared": "Les rapports d'audit sont partagés avec les parties prenantes.",
  "criterion.api-ready-for-publishing": "L'API est prête à être publiée sur les passerelles et dans les environnements appropriés afin de permettre sa réutilisation par plusieurs consommateurs d'API.",
  "criterion.api-documentation-ready": "La documentation de l'API est complète et prête à être publiée.",
  "criterion.consumer-support-ready": "Les processus d'enregistrement, d'assistance et de communication relatifs à l'API sont en place.",
  "criterion.legal-compliance-clear": "Les exigences légales et de conformité sont suffisamment précises pour permettre la publication."
}