{
  "entry_criteria": "Entry criteria",
  "exit_criteria": "Exit criteria",
  "criterion.metrics-feedback-available": "Insights from metrics and feedback are available to optimize existing APIs.",
  "criterion.business-goals-defined": "Business goals are defined.",
  "criterion.market-research-done": "Market research identifies API opportunities.",
  "criterion.stakeholder-approval": "Stakeholders approve strategy discussions.",
  "criterion.api-opportunity-documented": "Individual API opportunities are identified and documented.",
  "criterion.api-reusability": "The API meets a clear business need and is reusable for multiple API consumers.",
  "criterion.hide-backend-discrepancies": "The goal of the API is to hide backend data models and discrepancies.",
  "criterion.value-prop-validated": "The value proposition validates with key stakeholders.",
  "criterion.consumer-segments-identified": "API consumer segments (internal and external) are identified.",
  "criterion.api-roadmap-defined": "High-level roadmaps for API development are established.",
  "criterion.architecture-patterns-validated": "The API architecture uses patterns that promote reusability and integration, and is validated with stakeholders.",
  "criterion.design-reflects-business-value": "The API's design and endpoints have a clear connection to their business value and features.",
  "criterion.api-consistency": "API has a consistent design with our other API products.",
  "criterion.api-contract-tested": "The API contract is tested and meets functional and non-functional requirements.",
  "criterion.api-description-available": "The API and its endpoints have descriptions that explain their business value and features.",
  "criterion.audit-passed": "The API passes compliance, security, and audit checks.",
  "criterion.audit-reports-shared": "Audit reports are shared with stakeholders.",
  "criterion.api-ready-for-publishing": "The API is ready to be published to the appropriate gateways and environments to support reusability for multiple API consumers.",
  "criterion.api-documentation-ready": "API documentation is complete and ready for publishing.",
  "criterion.consumer-support-ready": "API registration, support, and communication processes are in place.",
  "criterion.legal-compliance-clear": "Legal and compliance requirements are precise enough for publishing."
}