{
  "exit_criteria": "Critérios de saída",
  "entry_criteria": "Critérios de entrada",
  "criterion.metrics-feedback-available": "Informações obtidas a partir de métricas e feedback estão disponíveis para otimizar as APIs existentes",
  "criterion.business-goals-defined": "As metas de negócios estão definidas",
  "criterion.market-research-done": "A pesquisa de mercado identifica oportunidades de API",
  "criterion.stakeholder-approval": "As partes interessadas aprovam as discussões sobre a estratégia",
  "criterion.api-opportunity-documented": "As oportunidades individuais de API são identificadas e documentadas",
  "criterion.api-reusability": "A API atende a uma necessidade clara de negócios e é reutilizável para vários consumidores de API",
  "criterion.hide-backend-discrepancies": "O objetivo da API é ocultar modelos de dados de back-end e discrepâncias.",
  "criterion.value-prop-validated": "A proposta de valor é validada pelas principais partes interessadas.",
  "criterion.consumer-segments-identified": "Os segmentos de consumidores de API (internos e externos) são identificados.",
  "criterion.api-roadmap-defined": "Roteiros de alto nível para o desenvolvimento de API são estabelecidos.",
  "criterion.architecture-patterns-validated": "A arquitetura da API usa padrões que promovem a reutilização e a integração e é validada pelas partes interessadas.",
  "criterion.design-reflects-business-value": "O design e os pontos finais da API têm uma conexão clara com seu valor comercial e recursos.",
  "criterion.api-consistency": "A API tem um design consistente com nossos outros produtos API.",
  "criterion.api-contract-tested": "O contrato da API é testado e atende aos requisitos funcionais e não funcionais.",
  "criterion.api-description-available": "A API e seus pontos finais têm descrições que explicam seu valor comercial e recursos.",
  "criterion.audit-passed": "A API é aprovada nas verificações de conformidade, segurança e auditoria.",
  "criterion.audit-reports-shared": "Os relatórios de auditoria são compartilhados com as partes interessadas.",
  "criterion.api-ready-for-publishing": "A API está pronta para ser publicada nos gateways e ambientes apropriados para oferecer suporte à reutilização por vários consumidores de API.",
  "criterion.api-documentation-ready": "A documentação da API está completa e pronta para publicação.",
  "criterion.consumer-support-ready": "Os processos de registro, suporte e comunicação da API estão em vigor.",
  "criterion.legal-compliance-clear": "Os requisitos legais e de conformidade são precisos o suficiente para publicação."
}