{
  "resource.api-community-engagement-strategies.title": "Estratégias de envolvimento da comunidade API",
  "resource.api-community-engagement-strategies.description": "Um manual para promover a adoção de APIs, cultivando comunidades através de conteúdos, canais de apoio, ciclos de feedback e estratégias de envolvimento social.",
  "resource.api-community-engagement-strategies.outcomes": "Melhor compreensão dos princípios das estratégias de envolvimento da comunidade da API",
  "resource.api-community-engagement-strategies.outcomes.1": "Abordagem padronizada usando as estratégias de envolvimento da comunidade da API",
  "resource.api-community-engagement-strategies.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-community-engagement-strategies.steps": "Desenvolver estratégias de marketing para promover as API junto de públicos-alvo, incluindo redes sociais, blogues e webinars.",
  "resource.api-community-engagement-strategies.steps.1": "Criar materiais promocionais (por exemplo, estudos de casos, histórias de sucesso) que realcem o valor e as vantagens das API.",
  "resource.api-community-engagement-strategies.steps.2": "Criar materiais educativos (por exemplo, tutoriais, documentação) que expliquem as caraterísticas, as vantagens e os padrões de utilização da API.",
  "resource.api-community-engagement-strategies.steps.3": "Interagir com os consumidores da API através de ciclos de feedback, canais de apoio e fóruns da comunidade para compreender as suas necessidades e melhorar a adoção da API.",
  "resource.api-community-engagement-strategies.steps.4": "Analisar as métricas de utilização da API e incorporar o feedback dos utilizadores nas iterações da API.",
  "resource.api-community-engagement-strategies.tips": "Personalize as estratégias de envolvimento da comunidade da API para o seu domínio",
  "resource.api-community-engagement-strategies.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-compliance-best-practices.title": "Melhores práticas de conformidade da API",
  "resource.api-compliance-best-practices.description": "Garantir que as APIs cumprem a conformidade legal, regulamentar e interna através de documentação, controlos e validações automatizadas.",
  "resource.api-compliance-best-practices.outcomes": "Melhor compreensão dos princípios das melhores práticas de conformidade da API",
  "resource.api-compliance-best-practices.outcomes.1": "Abordagem normalizada utilizando as Melhores Práticas de Conformidade da API",
  "resource.api-compliance-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-compliance-best-practices.steps": "Documentar as medidas de conformidade e garantir que são comunicadas às partes interessadas e aos consumidores.",
  "resource.api-compliance-best-practices.steps.1": "Implementar medidas para garantir que as APIs cumprem estes requisitos, incluindo encriptação de dados, controlos de acesso e pistas de auditoria.",
  "resource.api-compliance-best-practices.steps.2": "Utilizar listas de controlo, linters e ferramentas de teste para verificar a consistência e a conformidade com as normas.",
  "resource.api-compliance-best-practices.tips": "Personalizar as Melhores Práticas de Conformidade da API para o seu domínio",
  "resource.api-compliance-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-development-best-practices.title": "Melhores práticas de desenvolvimento de API",
  "resource.api-development-best-practices.description": "Diretrizes que promovem bases de código API consistentes e passíveis de manutenção, utilizando bibliotecas normalizadas, padrões reutilizáveis e fluxos de trabalho de desenvolvimento alinhados.",
  "resource.api-development-best-practices.outcomes": "Melhor compreensão dos princípios das melhores práticas de desenvolvimento de API",
  "resource.api-development-best-practices.outcomes.1": "Abordagem normalizada utilizando as melhores práticas de desenvolvimento de API",
  "resource.api-development-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-development-best-practices.steps": "Utilizar estruturas e bibliotecas estabelecidas para implementar APIs, assegurando a sua reutilização e manutenção.",
  "resource.api-development-best-practices.steps.1": "Seguir as normas de codificação e as melhores práticas para garantir um desenvolvimento de API consistente e de alta qualidade.",
  "resource.api-development-best-practices.tips": "Personalize as práticas recomendadas de desenvolvimento de API para o seu domínio",
  "resource.api-development-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-metrics-and-analytics.title": "Métricas e análises de API",
  "resource.api-metrics-and-analytics.description": "Um recurso para definir, recolher e analisar o desempenho da API e os dados de utilização para alinhar os KPIs técnicos com os resultados comerciais.",
  "resource.api-metrics-and-analytics.outcomes": "Melhor compreensão dos princípios de métrica e análise de API",
  "resource.api-metrics-and-analytics.outcomes.1": "Abordagem padronizada usando métricas e análises de API",
  "resource.api-metrics-and-analytics.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-metrics-and-analytics.steps": "Identificar indicadores-chave de desempenho (KPIs) para medir o sucesso da API em relação aos objectivos comerciais.",
  "resource.api-metrics-and-analytics.steps.1": "Definir e monitorizar as métricas de desempenho (por exemplo, chamadas API, latência, taxas de erro) e as métricas de adoção (por exemplo, NPS).",
  "resource.api-metrics-and-analytics.steps.2": "Monitorizar as iniciativas API para garantir o cumprimento das orientações operacionais e das práticas de governação",
  "resource.api-metrics-and-analytics.tips": "Personalizar as métricas e análises da API para o seu domínio",
  "resource.api-metrics-and-analytics.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-onboarding-best-practices.title": "Melhores práticas de integração de API",
  "resource.api-onboarding-best-practices.description": "Práticas recomendadas para simplificar as jornadas de integração do consumidor da API com registo passo a passo, descoberta e orientação na primeira chamada.",
  "resource.api-onboarding-best-practices.outcomes": "Melhor compreensão dos princípios das melhores práticas de integração de API",
  "resource.api-onboarding-best-practices.outcomes.1": "Abordagem padronizada usando as práticas recomendadas de integração de API",
  "resource.api-onboarding-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-onboarding-best-practices.steps": "Definir o percurso do consumidor da API desde a descoberta até à resolução de problemas, identificando os principais pontos de contacto e os pontos problemáticos.",
  "resource.api-onboarding-best-practices.steps.1": "Desenvolver processos de integração e recursos para ajudar os consumidores de API a compreender como utilizar as API de forma eficaz.",
  "resource.api-onboarding-best-practices.steps.2": "Documentar a forma como os consumidores encontram e utilizam a API, incluindo processos de integração e registo.",
  "resource.api-onboarding-best-practices.tips": "Personalizar as práticas recomendadas de integração da API para o seu domínio",
  "resource.api-onboarding-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-portfolio-management-guidelines.title": "Diretrizes de gestão da carteira API",
  "resource.api-portfolio-management-guidelines.description": "Um guia para gerenciar estrategicamente o conjunto de APIs de uma organização - priorizando APIs, alocando recursos e monitorando o desempenho em todos os ciclos de vida.",
  "resource.api-portfolio-management-guidelines.outcomes": "Melhor compreensão dos princípios orientadores da gestão de carteiras API",
  "resource.api-portfolio-management-guidelines.outcomes.1": "Abordagem padronizada usando as diretrizes de gerenciamento de portfólio da API",
  "resource.api-portfolio-management-guidelines.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-portfolio-management-guidelines.steps": "Definir práticas de gestão da carteira que descrevam os processos de gestão da carteira de API, incluindo a definição de prioridades, a monitorização e a otimização.",
  "resource.api-portfolio-management-guidelines.steps.1": "Definir práticas de gestão orçamental e de recursos que descrevam os processos de gestão de orçamentos e recursos para iniciativas de API.",
  "resource.api-portfolio-management-guidelines.steps.2": "Estabelecer critérios para avaliar e dar prioridade às dotações orçamentais com base no valor comercial, no impacto e no alinhamento com as iniciativas estratégicas.",
  "resource.api-portfolio-management-guidelines.steps.3": "Monitorizar a carteira de APIs para garantir que as APIs estão a fornecer valor, a cumprir as expectativas de desempenho e a alinhar-se com os objectivos comerciais.",
  "resource.api-portfolio-management-guidelines.tips": "Personalizar as Diretrizes de Gestão de Portfólio API para o seu domínio",
  "resource.api-portfolio-management-guidelines.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-security-best-practices.title": "Melhores práticas de segurança da API",
  "resource.api-security-best-practices.description": "Um conjunto de controlos acionáveis para proteger APIs, incluindo autenticação, autorização, encriptação, limitação de taxas e verificações de conformidade ao nível do pipeline.",
  "resource.api-security-best-practices.outcomes": "Melhor compreensão dos princípios das melhores práticas de segurança da API",
  "resource.api-security-best-practices.outcomes.1": "Abordagem normalizada utilizando as melhores práticas de segurança da API",
  "resource.api-security-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-security-best-practices.steps": "Garantir que as APIs cumprem os requisitos de segurança e conformidade através de verificações e auditorias automatizadas.",
  "resource.api-security-best-practices.steps.1": "Implemente medidas de segurança como autenticação, autorização, encriptação e limitação de taxas para proteger as APIs de ameaças.",
  "resource.api-security-best-practices.steps.2": "Implementar verificações de segurança automatizadas e validações de conformidade no pipeline CI/CD para garantir que as APIs são seguras e compatíveis.",
  "resource.api-security-best-practices.tips": "Personalize as práticas recomendadas de segurança da API para o seu domínio",
  "resource.api-security-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-team-structure-guidelines.title": "Diretrizes da estrutura da equipa API",
  "resource.api-team-structure-guidelines.description": "Orientação organizacional para a definição de funções e responsabilidades nas equipas de API para garantir clareza, colaboração e responsabilidade.",
  "resource.api-team-structure-guidelines.outcomes": "Melhor compreensão dos princípios orientadores da estrutura da equipa API",
  "resource.api-team-structure-guidelines.outcomes.1": "Abordagem normalizada utilizando as Diretrizes da Estrutura da Equipa API",
  "resource.api-team-structure-guidelines.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-team-structure-guidelines.steps": "Definir estruturas de equipa e funções para equipas de API, incluindo proprietários de produtos de API, programadores, arquitectos e operações.",
  "resource.api-team-structure-guidelines.tips": "Personalizar as Diretrizes da estrutura da equipa API para o seu domínio",
  "resource.api-team-structure-guidelines.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-testing-best-practices.title": "Melhores práticas de teste de API",
  "resource.api-testing-best-practices.description": "Diretrizes para a implementação de testes automatizados funcionais, de desempenho e de segurança ao longo do ciclo de vida da API.",
  "resource.api-testing-best-practices.outcomes": "Melhor compreensão dos princípios das melhores práticas de teste de API",
  "resource.api-testing-best-practices.outcomes.1": "Abordagem normalizada utilizando as melhores práticas de teste de API",
  "resource.api-testing-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-testing-best-practices.steps": "Testar a funcionalidade, a segurança e o desempenho das API, utilizando ferramentas de teste automatizadas.",
  "resource.api-testing-best-practices.steps.1": "Integrar testes funcionais e não funcionais no pipeline CI/CD para garantir que as APIs cumprem as normas de qualidade.",
  "resource.api-testing-best-practices.steps.2": "Utilizar ferramentas de teste automatizadas para validar a funcionalidade, a segurança e o desempenho da API.",
  "resource.api-testing-best-practices.tips": "Personalize as práticas recomendadas de teste de API para o seu domínio",
  "resource.api-testing-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-training-programs.title": "Programas de formação API",
  "resource.api-training-programs.description": "Um roteiro para melhorar as competências das equipas com percursos de aprendizagem estruturados em design, governação, desempenho e segurança de API.",
  "resource.api-training-programs.outcomes": "Melhor compreensão dos princípios dos programas de formação API",
  "resource.api-training-programs.outcomes.1": "Abordagem padronizada utilizando Programas de Formação API",
  "resource.api-training-programs.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-training-programs.steps": "Identificar as principais competências e áreas de conhecimento da API que precisam de ser melhoradas, como a conceção, a segurança e o desempenho da API.",
  "resource.api-training-programs.steps.1": "Incentivar a aprendizagem contínua através de cursos em linha, certificações e envolvimento da comunidade.",
  "resource.api-training-programs.steps.2": "Fornecer formação e recursos para ajudar as equipas a adotar uma mentalidade de prioridade à API e a compreender as vantagens das API.",
  "resource.api-training-programs.steps.3": "Fornecer programas de formação, workshops e recursos para ajudar as equipas a melhorar as suas competências e conhecimentos em matéria de API.",
  "resource.api-training-programs.tips": "Personalizar os programas de formação API para o seu domínio",
  "resource.api-training-programs.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-versioning-best-practices.title": "Práticas recomendadas de controle de versão da API",
  "resource.api-versioning-best-practices.description": "Estratégias para introduzir, manter e retirar versões de API, preservando a compatibilidade com versões anteriores e a confiança dos consumidores.",
  "resource.api-versioning-best-practices.outcomes": "Melhor compreensão dos princípios das melhores práticas de controlo de versões da API",
  "resource.api-versioning-best-practices.outcomes.1": "Abordagem padronizada usando as práticas recomendadas de controle de versão da API",
  "resource.api-versioning-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-versioning-best-practices.steps": "Definir estratégias de controlo de versões para as API para gerir as alterações e garantir a compatibilidade com as versões anteriores.",
  "resource.api-versioning-best-practices.tips": "Personalizar as práticas recomendadas de controle de versão da API para o seu domínio",
  "resource.api-versioning-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.apiops-CI-CD-for-apis.title": "APIOps CI/CD para APIs",
  "resource.apiops-CI-CD-for-apis.description": "Orientação de implantação que integra tarefas do ciclo de vida da API - design, teste, governança - em pipelines de integração e entrega contínuas.",
  "resource.apiops-CI-CD-for-apis.outcomes": "Melhor compreensão dos princípios de CI/CD para APIs",
  "resource.apiops-CI-CD-for-apis.outcomes.1": "Abordagem padronizada usando CI/CD para APIs",
  "resource.apiops-CI-CD-for-apis.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.apiops-CI-CD-for-apis.steps": "Utilizar pipelines CI/CD para automatizar os processos de construção, teste e implementação, garantindo uma qualidade e rastreabilidade consistentes.",
  "resource.apiops-CI-CD-for-apis.steps.1": "Integrar testes automatizados no pipeline CI/CD para garantir a validação contínua da qualidade da API.",
  "resource.apiops-CI-CD-for-apis.steps.2": "Implementar estratégias de implantação (por exemplo, implantações blue-green, lançamentos canários) para minimizar os riscos durante os lançamentos de API.",
  "resource.apiops-CI-CD-for-apis.steps.3": "Crie o hábito de analisar os indicadores e planear actividades de melhoria contínua.",
  "resource.apiops-CI-CD-for-apis.tips": "Personalize as APIs CI/CD For para o seu domínio",
  "resource.apiops-CI-CD-for-apis.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.competitor-analysis-template.title": "Modelo de análise da concorrência",
  "resource.competitor-analysis-template.description": "Uma folha de cálculo estruturada para comparar as suas ofertas de API com a concorrência, mapeando os pontos fortes, os pontos fracos e os diferenciadores de valor.",
  "resource.competitor-analysis-template.outcomes": "Melhor compreensão dos princípios do modelo de análise da concorrência",
  "resource.competitor-analysis-template.outcomes.1": "Abordagem normalizada utilizando o modelo de análise da concorrência",
  "resource.competitor-analysis-template.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.competitor-analysis-template.steps": "Efetuar uma análise da concorrência para identificar os principais concorrentes e as suas ofertas de API.",
  "resource.competitor-analysis-template.steps.1": "Analisar as API da concorrência para compreender os seus pontos fortes, fracos e pontos de venda únicos.",
  "resource.competitor-analysis-template.tips": "Personalizar o modelo de análise da concorrência para o seu domínio",
  "resource.competitor-analysis-template.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.contract-first-design.title": "Primeira conceção do contrato",
  "resource.contract-first-design.description": "Uma diretriz que defende abordagens API-first utilizando contratos formais (por exemplo, OpenAPI) para alinhar as partes interessadas antes do desenvolvimento.",
  "resource.contract-first-design.outcomes": "Melhor compreensão dos princípios de conceção da primeira fase do contrato",
  "resource.contract-first-design.outcomes.1": "Abordagem normalizada utilizando o Contract First Design",
  "resource.contract-first-design.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.contract-first-design.steps": "Aplicar abordagens \"contract-first\" ou \"design-first\" para garantir que os contratos API são validados antes da implementação.",
  "resource.contract-first-design.steps.1": "Definir contratos de API que descrevam as expectativas, responsabilidades e diretrizes de utilização para cada API.",
  "resource.contract-first-design.steps.2": "Utilizar formatos normalizados (por exemplo, OpenAPI, AsyncAPI) para criar contratos de API legíveis por máquina que sejam fáceis de partilhar e validar.",
  "resource.contract-first-design.tips": "Personalize o design do Contract First para o seu domínio",
  "resource.contract-first-design.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.cross-functional-collaboration-best-practices.title": "Melhores práticas de colaboração interfuncional",
  "resource.cross-functional-collaboration-best-practices.description": "Práticas para facilitar a comunicação e o alinhamento entre as equipas comerciais e técnicas ao planear ou fornecer APIs.",
  "resource.cross-functional-collaboration-best-practices.outcomes": "Melhor compreensão dos princípios das melhores práticas de colaboração interfuncional",
  "resource.cross-functional-collaboration-best-practices.outcomes.1": "Abordagem normalizada utilizando as melhores práticas de colaboração interfuncional",
  "resource.cross-functional-collaboration-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.cross-functional-collaboration-best-practices.steps": "Incentivar a colaboração multifuncional entre equipas de API, unidades empresariais e partes interessadas para alinhar as iniciativas de API com os objectivos empresariais.",
  "resource.cross-functional-collaboration-best-practices.tips": "Personalize as Melhores Práticas de Colaboração Interfuncional para o seu domínio",
  "resource.cross-functional-collaboration-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.data-privacy-guidelines.title": "Diretrizes de privacidade de dados",
  "resource.data-privacy-guidelines.description": "Considerações de design para garantir que as APIs cumprem os regulamentos de proteção de dados, como o RGPD, através de anonimização e controlos de acesso.",
  "resource.data-privacy-guidelines.outcomes": "Melhor compreensão dos princípios das diretrizes relativas à privacidade dos dados",
  "resource.data-privacy-guidelines.outcomes.1": "Abordagem normalizada utilizando as Diretrizes de Privacidade de Dados",
  "resource.data-privacy-guidelines.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.data-privacy-guidelines.steps": "Garantir a privacidade dos dados dos utilizadores através da implementação de medidas de proteção de dados, como a anonimização e os controlos de acesso.",
  "resource.data-privacy-guidelines.tips": "Personalizar as Diretrizes de Privacidade de Dados para o seu domínio",
  "resource.data-privacy-guidelines.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.domain-canvas.title": "Domain Canvas",
  "resource.domain-canvas.description": "Uma ferramenta de modelação para definir e comunicar as principais entidades e relações no seu domínio, assegurando a consistência semântica entre APIs.",
  "resource.domain-canvas.outcomes": "Melhor compreensão dos princípios do domínio canvas",
  "resource.domain-canvas.outcomes.1": "Abordagem normalizada utilizando o Domain Canvas",
  "resource.domain-canvas.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.domain-canvas.steps": "Definir entidades principais, os seus atributos e relações para criar um entendimento concetual partilhado entre APIs.",
  "resource.domain-canvas.tips": "Personalizar o Canvas do domínio para o seu domínio",
  "resource.domain-canvas.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.ecosystem-vision-template.title": "Modelo de visão do ecossistema",
  "resource.ecosystem-vision-template.description": "Uma ferramenta de planeamento estratégico para definir o ecossistema API, incluindo parceiros-alvo, cadeias de valor e oportunidades de integração.",
  "resource.ecosystem-vision-template.outcomes": "Melhor compreensão dos princípios do modelo de visão do ecossistema",
  "resource.ecosystem-vision-template.outcomes.1": "Abordagem padronizada usando o Modelo de Visão do Ecossistema",
  "resource.ecosystem-vision-template.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.ecosystem-vision-template.steps": "Realizar estudos de mercado para identificar tendências, oportunidades e ameaças no panorama das API.",
  "resource.ecosystem-vision-template.steps.1": "Identificar os principais parceiros e intervenientes do ecosistema que irão beneficiar ou contribuir para o ecosistema.",
  "resource.ecosystem-vision-template.steps.2": "Identifique as lacunas no mercado que as suas API podem preencher, com base nas ofertas da concorrência.",
  "resource.ecosystem-vision-template.steps.3": "Identifique potenciais parceiros cujas APIs possam melhorar as suas capacidades de API e a sua proposta de valor.",
  "resource.ecosystem-vision-template.steps.4": "Desenvolva uma estratégia de diferenciação que destaque as caraterísticas e benefícios únicos das suas APIs.",
  "resource.ecosystem-vision-template.steps.5": "Defina a visão do ecossistema para as suas APIs, incluindo a forma como estas irão interagir com outros sistemas e plataformas.",
  "resource.ecosystem-vision-template.steps.6": "Conceber APIs para permitir uma integração e colaboração perfeitas no ecossistema.",
  "resource.ecosystem-vision-template.tips": "Personalizar o modelo de visão do ecossistema para o seu domínio",
  "resource.ecosystem-vision-template.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.industry-standards-and-best-practices.title": "Normas e melhores práticas do sector",
  "resource.industry-standards-and-best-practices.description": "Um recurso de referência para alinhar o design e a operação da API com estruturas e especificações amplamente reconhecidas do sector.",
  "resource.industry-standards-and-best-practices.outcomes": "Melhor compreensão das normas do sector e dos princípios das melhores práticas",
  "resource.industry-standards-and-best-practices.outcomes.1": "Abordagem normalizada utilizando as normas e as melhores práticas do sector",
  "resource.industry-standards-and-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.industry-standards-and-best-practices.steps": "Identificar as normas e as melhores práticas do sector para garantir que as API são competitivas e estão em conformidade.",
  "resource.industry-standards-and-best-practices.tips": "Personalize os padrões e as melhores práticas da indústria para o seu domínio",
  "resource.industry-standards-and-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.partner-integration-guidelines.title": "Diretrizes de integração de parceiros",
  "resource.partner-integration-guidelines.description": "Listas de verificação de integração e padrões de comunicação para gerir os aspectos técnicos e legais das relações com APIs de terceiros.",
  "resource.partner-integration-guidelines.outcomes": "Melhor compreensão dos princípios das diretrizes de integração de parceiros",
  "resource.partner-integration-guidelines.outcomes.1": "Abordagem normalizada utilizando as Diretrizes de Integração de Parceiros",
  "resource.partner-integration-guidelines.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.partner-integration-guidelines.steps": "Estabelecer processos de integração e orientações para colaborar com os parceiros, incluindo a integração técnica, a partilha de dados e o apoio.",
  "resource.partner-integration-guidelines.steps.1": "Monitorize o desempenho e a conformidade da API do parceiro para garantir a fiabilidade e o alinhamento com a sua estratégia de API.",
  "resource.partner-integration-guidelines.tips": "Personalizar as Diretrizes de Integração de Parceiros para o seu domínio",
  "resource.partner-integration-guidelines.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.role-communication-best-practices.title": "Melhores práticas de comunicação de funções",
  "resource.role-communication-best-practices.description": "Ferramentas para definir e documentar quem é responsável por quê nas iniciativas de API, garantindo que as transferências e a responsabilidade sejam claras.",
  "resource.role-communication-best-practices.outcomes": "Melhor compreensão dos princípios das melhores práticas de comunicação de funções",
  "resource.role-communication-best-practices.outcomes.1": "Abordagem normalizada utilizando as melhores práticas de comunicação de funções",
  "resource.role-communication-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.role-communication-best-practices.steps": "Estabelecer responsabilidades claras para cada função, incluindo a conceção, o desenvolvimento, os testes e as operações da API.",
  "resource.role-communication-best-practices.steps.1": "Assegurar que as funções e responsabilidades são comunicadas a todos os membros da equipa e partes interessadas para garantir o alinhamento.",
  "resource.role-communication-best-practices.tips": "Personalizar as Melhores Práticas de Comunicação de Funções para o seu domínio",
  "resource.role-communication-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.scalable-infrastructure-best-practices.title": "Melhores práticas de infraestrutura escalável",
  "resource.scalable-infrastructure-best-practices.description": "Orientação arquitetónica para garantir que as API são implementadas em infra-estruturas que podem lidar elasticamente com picos de utilização e crescimento.",
  "resource.scalable-infrastructure-best-practices.outcomes": "Melhor compreensão dos princípios das melhores práticas de infra-estruturas escaláveis",
  "resource.scalable-infrastructure-best-practices.outcomes.1": "Abordagem normalizada utilizando as Melhores Práticas de Infraestrutura Escalável",
  "resource.scalable-infrastructure-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.scalable-infrastructure-best-practices.steps": "Conceber a infraestrutura da API para ser escalável e resiliente, utilizando padrões e tecnologias nativos da nuvem.",
  "resource.scalable-infrastructure-best-practices.steps.1": "Monitorizar o desempenho e a capacidade da infraestrutura para garantir que esta consegue dar resposta à crescente procura.",
  "resource.scalable-infrastructure-best-practices.tips": "Personalize as Melhores Práticas de Infraestrutura Escalável para o seu domínio",
  "resource.scalable-infrastructure-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.service-agreement-template.title": "Modelo de contrato de serviço",
  "resource.service-agreement-template.description": "Um formato de acordo personalizável que define expectativas, SLAs, responsabilidades e termos de acesso para o consumo de API.",
  "resource.service-agreement-template.outcomes": "Melhor compreensão dos princípios do modelo de contrato de prestação de serviços",
  "resource.service-agreement-template.outcomes.1": "Abordagem normalizada utilizando o modelo de contrato de serviços",
  "resource.service-agreement-template.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.service-agreement-template.steps": "Defina acordos de serviço que descrevam as expectativas, os níveis de serviço e as responsabilidades de cada API.",
  "resource.service-agreement-template.steps.1": "Utilize formatos normalizados para criar contratos de serviço legíveis por máquina que sejam fáceis de partilhar e validar.",
  "resource.service-agreement-template.steps.2": "Assegurar que os acordos de serviço são revistos e aprovados pelas partes interessadas para garantir o alinhamento e a clareza.",
  "resource.service-agreement-template.tips": "Personalizar o modelo de contrato de serviço para o seu domínio",
  "resource.service-agreement-template.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.stakeholder-engagement-best-practices.title": "Melhores práticas de envolvimento das partes interessadas",
  "resource.stakeholder-engagement-best-practices.description": "Tácticas de envolvimento para alinhar as partes interessadas internas e externas em torno dos objectivos, valor e governação partilhados da API.",
  "resource.stakeholder-engagement-best-practices.outcomes": "Melhor compreensão dos princípios das melhores práticas de envolvimento das partes interessadas",
  "resource.stakeholder-engagement-best-practices.outcomes.1": "Abordagem padronizada usando as Melhores Práticas de Envolvimento das Partes Interessadas",
  "resource.stakeholder-engagement-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.stakeholder-engagement-best-practices.steps": "Envolver as partes interessadas para garantir o alinhamento e o apoio às iniciativas da API.",
  "resource.stakeholder-engagement-best-practices.tips": "Personalize as Melhores Práticas de Envolvimento das Partes Interessadas para o seu domínio",
  "resource.stakeholder-engagement-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.test-automation-frameworks.title": "Estruturas de automatização de testes",
  "resource.test-automation-frameworks.description": "Ferramentas e padrões recomendados para automatizar testes de contrato, regressão e integração de API em vários ambientes.",
  "resource.test-automation-frameworks.outcomes": "Melhor compreensão dos princípios das estruturas de automatização de testes",
  "resource.test-automation-frameworks.outcomes.1": "Abordagem normalizada utilizando estruturas de automatização de testes",
  "resource.test-automation-frameworks.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.test-automation-frameworks.steps": "Implementar estruturas de automatização de testes que apoiem os testes de contrato, os testes de integração e os testes de ponta a ponta.",
  "resource.test-automation-frameworks.tips": "Personalizar as estruturas de automatização de testes para o seu domínio",
  "resource.test-automation-frameworks.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.vendor-management-best-practices.title": "Melhores práticas de gestão de fornecedores",
  "resource.vendor-management-best-practices.description": "Estrutura para avaliar e gerir fornecedores externos de API e integrações de terceiros com base no risco, desempenho e conformidade.",
  "resource.vendor-management-best-practices.outcomes": "Melhor compreensão dos princípios das melhores práticas de gestão de fornecedores",
  "resource.vendor-management-best-practices.outcomes.1": "Abordagem normalizada utilizando as melhores práticas de gestão de fornecedores",
  "resource.vendor-management-best-practices.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.vendor-management-best-practices.steps": "Estabelecer processos de gestão de fornecedores para avaliar, integrar e monitorizar fornecedores de API de terceiros.",
  "resource.vendor-management-best-practices.steps.1": "Definir critérios para avaliar as API dos fornecedores, incluindo fiabilidade, segurança e conformidade.",
  "resource.vendor-management-best-practices.tips": "Personalize as Melhores Práticas de Gestão de Fornecedores para o seu domínio",
  "resource.vendor-management-best-practices.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-audit-checklist.title": "Lista de verificação de auditoria da API",
  "resource.api-audit-checklist.description": "Uma lista de verificação abrangente para verificar a prontidão da API antes da publicação, abrangendo o design, a documentação, a segurança e a conformidade com a política.",
  "resource.api-audit-checklist.outcomes": "Melhor compreensão dos princípios da lista de controlo de auditoria da API",
  "resource.api-audit-checklist.outcomes.1": "Abordagem padronizada usando a lista de verificação de auditoria da API",
  "resource.api-audit-checklist.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-audit-checklist.steps": "Utilize a lista de verificação de auditoria da API para garantir que a conceção da API cumpre os requisitos funcionais e não funcionais, incluindo segurança, desempenho e conformidade.",
  "resource.api-audit-checklist.steps.1": "Realizar auditorias para garantir que as APIs cumprem as normas organizacionais, técnicas e legais antes da publicação.",
  "resource.api-audit-checklist.steps.2": "Garantir que os modelos de segurança, a configuração da porta de ligação e os termos legais sejam claros e acessíveis aos consumidores.",
  "resource.api-audit-checklist.tips": "Personalizar a lista de verificação de auditoria da API para o seu domínio",
  "resource.api-audit-checklist.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-business-model-canvas.title": "API Business Model Canvas",
  "resource.api-business-model-canvas.description": "Avaliar estrategicamente a viabilidade do negócio de API, mapeando propostas de valor, segmentos de consumidores e recursos-chave.",
  "resource.api-business-model-canvas.outcomes": "Estratégia comercial clara para APIs",
  "resource.api-business-model-canvas.outcomes.1": "Identificação dos principais recursos e parceiros",
  "resource.api-business-model-canvas.outcomes.2": "Alinhamento das caraterísticas da API com os objectivos comerciais",
  "resource.api-business-model-canvas.steps": "Resumir a proposta de valor da API",
  "resource.api-business-model-canvas.steps.1": "Definir segmentos de consumidores",
  "resource.api-business-model-canvas.steps.2": "Identificar estratégias de relações com os promotores",
  "resource.api-business-model-canvas.steps.3": "Mapear os canais de distribuição",
  "resource.api-business-model-canvas.steps.4": "documentar os principais recursos e actividades",
  "resource.api-business-model-canvas.steps.5": "Identificar os principais parceiros e partes interessadas",
  "resource.api-business-model-canvas.steps.6": "Destacar os benefícios e os custos",
  "resource.api-business-model-canvas.tips": "Começar com uma única API para garantir a clareza",
  "resource.api-business-model-canvas.tips.1": "Utilizar métricas como custo vs. benefício para dar prioridade às oportunidades",
  "resource.api-business-model-canvas.tips.2": "Validar os resultados com as principais partes interessadas",
  "resource.api-design-principles.title": "Princípios de conceção da API",
  "resource.api-design-principles.description": "Um guia conciso para a usabilidade, descoberta e consistência da API, baseado em filosofias de design comprovadas e nas necessidades dos utilizadores.",
  "resource.api-design-principles.outcomes": "Melhor compreensão dos princípios de conceção das API",
  "resource.api-design-principles.outcomes.1": "Abordagem normalizada utilizando os princípios de conceção da API",
  "resource.api-design-principles.outcomes.2": "Melhoria da implementação das práticas de API relacionadas",
  "resource.api-design-principles.steps": "**Design que coloca o consumidor em primeiro lugar:** iniciar cada ciclo de APIOps recolhendo os objectivos do utilizador e os termos do domínio para que as APIs resolvam problemas reais.",
  "resource.api-design-principles.steps.1": "**Nomeação e comportamento consistentes:** aplicar convenções partilhadas para recursos, erros e formatos para tornar as API previsíveis.",
  "resource.api-design-principles.steps.2": "**Orientado para contratos:** capturar a interface com OpenAPI ou AsyncAPI antes da codificação para alinhar as equipas e permitir a automatização.",
  "resource.api-design-principles.steps.3": "**Usabilidade e facilidade de descoberta:** fornecer documentação e exemplos claros para que os programadores compreendam rapidamente como utilizar a API.",
  "resource.api-design-principles.steps.4": "**Iterar com segurança:** desenvolver os projectos em pequenos incrementos, com versões, para que as alterações não perturbem os consumidores existentes.",
  "resource.api-design-principles.tips": "Personalizar os princípios de conceção da API para o seu domínio",
  "resource.api-design-principles.tips.1": "Utilize-o de forma colaborativa entre as funções comerciais e tecnológicas",
  "resource.api-value-proposition-canvas.title": "API Value Proposition Canvas",
  "resource.api-value-proposition-canvas.description": "Alinhar as funcionalidades da API com as necessidades dos utilizadores, mapeando tarefas, problemas e ganhos para os produtos da API.",
  "resource.api-value-proposition-canvas.outcomes": "Desenvolvimento de funcionalidades específicas",
  "resource.api-value-proposition-canvas.outcomes.1": "Alinhamento com as necessidades dos utilizadores",
  "resource.api-value-proposition-canvas.outcomes.2": "Melhoria da satisfação do consumidor da API",
  "resource.api-value-proposition-canvas.steps": "Listar as tarefas do percurso do utilizador",
  "resource.api-value-proposition-canvas.steps.1": "Identificar as caraterísticas que proporcionam os ganhos esperados",
  "resource.api-value-proposition-canvas.steps.2": "Definir caraterísticas para enfrentar os desafios",
  "resource.api-value-proposition-canvas.steps.3": "Mapear caraterísticas para produtos API",
  "resource.api-value-proposition-canvas.tips": "Utilizar os dados do Customer Journey Canvas",
  "resource.api-value-proposition-canvas.tips.1": "Destaque para as caraterísticas que aliviam as dores ou aumentam os ganhos",
  "resource.api-value-proposition-canvas.tips.2": "Validar as caraterísticas com os consumidores da API para garantir o alinhamento",
  "resource.business-impact-canvas.title": "Business Impact Canvas",
  "resource.business-impact-canvas.description": "Conceber uma arquitetura de plataforma API escalável e segura que satisfaça os requisitos comerciais e técnicos.",
  "resource.business-impact-canvas.outcomes": "Infraestrutura API escalável",
  "resource.business-impact-canvas.outcomes.1": "Segurança e conformidade melhoradas",
  "resource.business-impact-canvas.outcomes.2": "Desempenho melhorado da API",
  "resource.business-impact-canvas.steps": "Riscos de disponibilidade: Identificar riscos e impactos.",
  "resource.business-impact-canvas.steps.1": "Formas de mitigar os riscos de disponibilidade: Definir medidas de mitigação.",
  "resource.business-impact-canvas.steps.2": "Riscos de segurança: Documentar os riscos relacionados com a segurança.",
  "resource.business-impact-canvas.steps.3": "Formas de mitigar os riscos de segurança: Propor estratégias para mitigar os riscos de segurança.",
  "resource.business-impact-canvas.steps.4": "Riscos dos dados: Identificar os riscos para a exatidão ou disponibilidade dos dados.",
  "resource.business-impact-canvas.steps.5": "Formas de mitigar os riscos dos dados: Planear estratégias para lidar com os riscos dos dados.",
  "resource.business-impact-canvas.tips": "Envolver os arquitectos e os promotores no processo de conceção",
  "resource.business-impact-canvas.tips.1": "Utilizar incidentes anteriores para identificar potenciais riscos",
  "resource.business-impact-canvas.tips.2": "Dar prioridade às APIs críticas com o maior impacto comercial",
  "resource.capacity-canvas.title": "Capacity Canvas",
  "resource.capacity-canvas.description": "Planear a capacidade da API para satisfazer as exigências comerciais actuais e futuras, garantindo a escalabilidade e o desempenho.",
  "resource.capacity-canvas.outcomes": "Alinhamento da capacidade da API com os volumes de negócios",
  "resource.capacity-canvas.outcomes.1": "Preparado para as futuras tendências de consumo",
  "resource.capacity-canvas.outcomes.2": "Estratégias definidas de armazenamento em cache e limitação de taxa",
  "resource.capacity-canvas.steps": "Documentar os volumes de negócios actuais",
  "resource.capacity-canvas.steps.1": "Prever as tendências de consumo futuras",
  "resource.capacity-canvas.steps.2": "Planear os picos de carga e os requisitos de disponibilidade",
  "resource.capacity-canvas.steps.3": "Definir estratégias de armazenamento em cache e de limitação de taxa",
  "resource.capacity-canvas.steps.4": "Propor estratégias de escalonamento",
  "resource.capacity-canvas.tips": "Utilizar a análise para prever tendências de crescimento",
  "resource.capacity-canvas.tips.1": "Definir cenários de picos de utilização",
  "resource.capacity-canvas.tips.2": "Incluir testes de escalabilidade na fase de planeamento",
  "resource.customer-journey-canvas.title": "Customer Journey Canvas",
  "resource.customer-journey-canvas.description": "Mapear os percursos dos clientes para identificar necessidades e pontos problemáticos, melhorando a conceção da API e a experiência do utilizador.",
  "resource.customer-journey-canvas.outcomes": "Melhoria da compreensão do cliente",
  "resource.customer-journey-canvas.outcomes.1": "Conceção melhorada da API",
  "resource.customer-journey-canvas.outcomes.2": "Melhor experiência do utilizador",
  "resource.customer-journey-canvas.steps": "Definir a personalidade do cliente",
  "resource.customer-journey-canvas.steps.1": "Identificar os factores que desencadeiam a viagem",
  "resource.customer-journey-canvas.steps.2": "Descrever o fim da viagem",
  "resource.customer-journey-canvas.steps.3": "Mapear as etapas do percurso com entradas/saídas",
  "resource.customer-journey-canvas.steps.4": "Identificar os problemas dos clientes",
  "resource.customer-journey-canvas.steps.5": "Resumir os ganhos dos clientes",
  "resource.customer-journey-canvas.steps.6": "Definir os inputs necessários e os outputs resultantes",
  "resource.customer-journey-canvas.steps.7": "Definir interações API para cada etapa",
  "resource.customer-journey-canvas.tips": "Iterar com o contributo da equipa para aperfeiçoar as etapas",
  "resource.customer-journey-canvas.tips.1": "Utilize os resultados deste quadro para informar outros quadros, como o quadro de proposta de valor da API",
  "resource.event-canvas.title": "Event Canvas",
  "resource.event-canvas.description": "Conceber APIs orientadas para eventos, definindo eventos, accionadores e lógica de processamento.",
  "resource.event-canvas.outcomes": "Arquitetura orientada para eventos definida",
  "resource.event-canvas.outcomes.1": "Limpar os accionadores de eventos e a lógica de processamento",
  "resource.event-canvas.outcomes.2": "Melhoria da capacidade de resposta a alterações em tempo real",
  "resource.event-canvas.steps": "Identificar os principais eventos do sistema",
  "resource.event-canvas.steps.1": "Definir accionadores para cada evento",
  "resource.event-canvas.steps.2": "Descrever a lógica de processamento backend para eventos",
  "resource.event-canvas.steps.3": "Especificar os resultados ou reconhecimentos resultantes",
  "resource.event-canvas.tips": "Utilizar esquemas de eventos para normalizar os formatos de eventos",
  "resource.event-canvas.tips.1": "documentar fluxos e dependências de eventos",
  "resource.event-canvas.tips.2": "Validar o processamento de eventos com casos de teste",
  "resource.graphql-canvas.title": "GraphQL Canvas",
  "resource.graphql-canvas.description": "Conceber APIs GraphQL definindo tipos, consultas, mutações e subscrições.",
  "resource.graphql-canvas.outcomes": "Conceção da API GraphQL estruturada",
  "resource.graphql-canvas.outcomes.1": "Tipos definidos e suas relações",
  "resource.graphql-canvas.outcomes.2": "Limpar consultas, mutações e subscrições",
  "resource.graphql-canvas.steps": "Que problemas estão os consumidores de API a tentar resolver? De que dados necessitam?",
  "resource.graphql-canvas.steps.1": "Definir tipos GraphQL e seus atributos: Quais são os principais tipos expostos (por exemplo, utilizador, encomenda, produto)?",
  "resource.graphql-canvas.steps.2": "Mapear relações entre tipos: Como é que os tipos se relacionam uns com os outros em consultas aninhadas?",
  "resource.graphql-canvas.steps.3": "Especificar consultas para a recuperação de dados",
  "resource.graphql-canvas.steps.4": "Definir mutações para a modificação de dados: Que operações irão modificar os dados (por exemplo, criar, atualizar, eliminar)?",
  "resource.graphql-canvas.steps.5": "Assinaturas de esboços para actualizações em tempo real",
  "resource.graphql-canvas.steps.6": "Definir autenticação e autorização: Quem pode aceder a que campos ou tipos?",
  "resource.graphql-canvas.steps.7": "Considerar se existem restrições de paginação, filtragem ou limitação de taxa",
  "resource.graphql-canvas.tips": "Utilizar a introspeção para validar definições de tipos",
  "resource.graphql-canvas.tips.1": "documentar exemplos de consultas e mutações",
  "resource.graphql-canvas.tips.2": "Assegurar que os nomes dos tipos são descritivos e coerentes",
  "resource.interaction-canvas.title": "Interaction Canvas",
  "resource.interaction-canvas.description": "Definir interações API, fluxos de trabalho e respostas esperadas para garantir uma experiência consistente do consumidor API.",
  "resource.interaction-canvas.outcomes": "Fluxos de trabalho de interação API claros",
  "resource.interaction-canvas.outcomes.1": "Entradas e saídas definidas para cada interação",
  "resource.interaction-canvas.outcomes.2": "Regras de validação consistentes em todas as interações",
  "resource.interaction-canvas.steps": "Mapear as interações da API para as tarefas do utilizador",
  "resource.interaction-canvas.steps.1": "Definir pontos finais para cada interação",
  "resource.interaction-canvas.steps.2": "documentar os inputs e outputs de cada interação",
  "resource.interaction-canvas.steps.3": "Especificar regras de validação e restrições",
  "resource.interaction-canvas.steps.4": "Criar modelos de interação para interações CRUD, orientadas para a consulta, orientadas para o comando e orientadas para o evento",
  "resource.interaction-canvas.tips": "Comece com casos de utilização comuns antes de lidar com casos extremos",
  "resource.interaction-canvas.tips.1": "Simular interações com dados simulados para validar fluxos de trabalho",
  "resource.interaction-canvas.tips.2": "documentar as respostas esperadas para interações bem e mal sucedidas",
  "resource.location-canvas.title": "Location Canvas",
  "resource.location-canvas.description": "Mapeie as localizações dos fornecedores e consumidores de API para garantir a conformidade e o desempenho em todas as regiões.",
  "resource.location-canvas.outcomes": "Conformidade com a regulamentação local",
  "resource.location-canvas.outcomes.1": "Desempenho optimizado da API em todas as regiões",
  "resource.location-canvas.outcomes.2": "Melhoria da compreensão das necessidades regionais",
  "resource.location-canvas.steps": "Mapa de localização dos fornecedores de API.",
  "resource.location-canvas.steps.1": "Documentar a localização dos consumidores.",
  "resource.location-canvas.steps.2": "Identificar os regulamentos aplicáveis.",
  "resource.location-canvas.steps.3": "Documentar onde os dados devem residir.",
  "resource.location-canvas.steps.4": "Assegurar que as API estão acessíveis em todas as regiões da rede previstas.",
  "resource.location-canvas.steps.5": "Validar o desempenho da rede em todas as regiões.",
  "resource.location-canvas.tips": "Colaborar com as equipas jurídicas e de conformidade",
  "resource.location-canvas.tips.1": "Validar o desempenho da rede nas principais regiões",
  "resource.location-canvas.tips.2": "Resolver proactivamente as restrições baseadas na localização",
  "resource.rest-canvas.title": "REST Canvas",
  "resource.rest-canvas.description": "Conceber APIs utilizando os princípios RESTful, definindo recursos, verbos e exemplos de pedidos e respostas.",
  "resource.rest-canvas.outcomes": "Conceção consistente da API RESTful",
  "resource.rest-canvas.outcomes.1": "Recursos definidos e suas interações",
  "resource.rest-canvas.outcomes.2": "Exemplos de pedidos e respostas para maior clareza",
  "resource.rest-canvas.steps": "Identificar os principais recursos expostos pela API",
  "resource.rest-canvas.steps.1": "Definir a estrutura do modelo de recursos da API",
  "resource.rest-canvas.steps.2": "Especificar os verbos HTTP utilizados para interagir com os recursos",
  "resource.rest-canvas.steps.3": "Fornecer exemplos de pedidos e respostas para cada verbo",
  "resource.rest-canvas.tips": "Utilizar métodos HTTP padrão (GET, POST, PUT, DELETE)",
  "resource.rest-canvas.tips.1": "Assegurar que os URIs dos recursos são intuitivos e coerentes",
  "resource.rest-canvas.tips.2": "tratamento de erros de documentos e códigos de resposta"
}
