{
  "exit_criteria": "Austrittskriterien",
  "entry_criteria": "Eintrittskriterien",
  "criterion.metrics-feedback-available": "Erkenntnisse aus Metriken und Feedback stehen zur Optimierung bestehender APIs zur Verfügung",
  "criterion.business-goals-defined": "Geschäftsziele sind definiert",
  "criterion.market-research-done": "Marktforschung identifiziert API-Möglichkeiten",
  "criterion.stakeholder-approval": "Stakeholder genehmigen Strategiediskussionen",
  "criterion.api-opportunity-documented": "Individuelle API-Möglichkeiten werden identifiziert und dokumentiert",
  "criterion.api-reusability": "Die API erfüllt einen klaren Geschäftsbedarf und ist für mehrere API-Nutzer wiederverwendbar",
  "criterion.hide-backend-discrepancies": "Das Ziel der API ist es, Backend-Datenmodelle und Diskrepanzen zu verbergen.",
  "criterion.value-prop-validated": "Das Wertversprechen wird mit den wichtigsten Stakeholdern validiert.",
  "criterion.consumer-segments-identified": "API-Nutzersegmente (intern und extern) werden identifiziert.",
  "criterion.api-roadmap-defined": "Hochrangige Roadmaps für die API-Entwicklung werden erstellt.",
  "criterion.architecture-patterns-validated": "Die API-Architektur verwendet Muster, die die Wiederverwendbarkeit und Integration fördern, und wird mit den Stakeholdern validiert.",
  "criterion.design-reflects-business-value": "Das Design und die Endpunkte der API stehen in klarem Zusammenhang mit ihrem geschäftlichen Nutzen und ihren Funktionen.",
  "criterion.api-consistency": "Die API weist ein einheitliches Design mit unseren anderen API-Produkten auf.",
  "criterion.api-contract-tested": "Der API-Vertrag wurde getestet und erfüllt die funktionalen und nicht-funktionalen Anforderungen.",
  "criterion.api-description-available": "Die API und ihre Endpunkte verfügen über Beschreibungen, die ihren geschäftlichen Nutzen und ihre Funktionen erläutern.",
  "criterion.audit-passed": "Die API besteht Compliance-, Sicherheits- und Audit-Prüfungen.",
  "criterion.audit-reports-shared": "Auditberichte werden mit den Stakeholdern geteilt.",
  "criterion.api-ready-for-publishing": "Die API kann in den entsprechenden Gateways und Umgebungen veröffentlicht werden, um die Wiederverwendbarkeit für mehrere API-Nutzer zu unterstützen.",
  "criterion.api-documentation-ready": "Die API-Dokumentation ist vollständig und bereit zur Veröffentlichung.",
  "criterion.consumer-support-ready": "Prozesse für die API-Registrierung, den Support und die Kommunikation sind eingerichtet.",
  "criterion.legal-compliance-clear": "Die rechtlichen und Compliance-Anforderungen sind für die Veröffentlichung präzise genug."
}