{
  "group.core-stations.title": "API-Lebenszyklus Kernstationen",
  "group.core-stations.description": "Die Kernstationen der API Metro, wo Teams lernen können, wie man APIs effektiv erstellt und verwaltet.",
  "group.sub-stations.title": "API-Lebenszyklus-Unterstationen",
  "group.sub-stations.description": "Unterstationen, die zusätzliche Ressourcen, Tools und bewährte Verfahren für API-Teams bereitstellen.",
  "station.api-product-strategy.title": "API-Produktstrategie - APIs in strategische Produkte verwandeln",
  "station.api-product-strategy.description": "Bevor Sie etwas bauen, sollten Sie von Anfang an den Wert, die Benutzer und die Geschäftsziele Ihrer API definieren.",
  "station.api-product-strategy.why_it_matters": "Viele Unternehmen betrachten APIs als technische Projekte und nicht als Produkte. Das Ergebnis? Verwirrte Kunden, schlechte Akzeptanz und verschwendeter Aufwand.\n\nDiese Station hilft Ihnen, den Zweck Ihrer API, die Zielgruppe und die Erfolgskriterien zu definieren, damit Teams APIs bereitstellen können, die echte Probleme lösen.",
  "station.api-product-strategy.apply_in_work": "Bereitstellung von Richtlinien und Vorlagen für die Erstellung von API-Geschäftsmodellen, Wertvorschlägen und Roadmaps.",
  "station.api-product-strategy.outcomes": "Ein klares API-Wertversprechen und eine klare Zielgruppe",
  "station.api-product-strategy.how_it_works": "Untersuchen Sie das Kunden- oder Partnerproblem, das Sie mit APIs lösen wollen. Zeichnen Sie die Stakeholder, deren Wege und Ergebnisse mithilfe der Customer Journey Canvas auf.",
  "station.api-consumer-experience.title": "API Consumer Experience - Design für die echten Benutzer Ihrer API",
  "station.api-consumer-experience.description": "Stellen Sie sicher, dass Ihre API auffindbar, verständlich und nutzbar ist - vor und nach der Einführung.",
  "station.api-consumer-experience.why_it_matters": "Großartige APIs funktionieren nicht nur - sie fühlen sich auch intuitiv an. Ganz gleich, ob Ihr Kunde ein interner Entwickler, ein externer Partner oder ein KI-Agent ist, seine Erfahrung entscheidet über die Akzeptanz.\n\nOhne einen klaren Erlebnisplan:\n- Großartige APIs bleiben ungenutzt\n- Teams verschwenden Zeit damit, zu raten, wie sie Ihre API verwenden sollen\n- Feedbackschleifen sind unterbrochen oder fehlen.\n\nDiese Station hilft Ihnen, Ihre API mit den Augen ihrer Nutzer zu sehen.",
 "station.api-consumer-experience.how_it_works": "Ordnen Sie Ihre API-Verbraucher und deren Anforderungen für das Onboarding mithilfe einer Onboarding-Journey-Vorlage oder des Customer Journey Canvas zu.",
 "station.api-consumer-experience.how_it_works.1": "Definieren Sie die API-Consumer-Journey von der Entdeckung bis zur Fehlerbehebung und identifizieren Sie wichtige Berührungspunkte und Schwachstellen.",  "station.api-consumer-experience.apply_in_work": "Bereitstellung von Richtlinien, Tools und Feedback-Mechanismen für das Verständnis, die Analyse und die Verbesserung der internen und externen Erfahrungen von Entwicklern und Partnern.",
  "station.api-consumer-experience.outcomes": "Identifizieren und priorisieren Sie Ihre API-Kunden",
  "station.api-platform-architecture.title": "API-Plattformarchitektur - Architektur von APIs für Skalierbarkeit und Wiederverwendung",
  "station.api-platform-architecture.description": "Gewährleisten Sie Skalierbarkeit, Wiederverwendung und Governance für Ihre API- und Plattformkomponenten.",
  "station.api-platform-architecture.why_it_matters": "Wenn APIs teamübergreifend skaliert werden, muss Ihre Plattform Governance und Wiederverwendung ermöglichen, ohne die Geschwindigkeit zu beeinträchtigen. Diese Station zeigt, wie man APIs für Langlebigkeit, Sicherheit und Effizienz entwickelt.",
  "station.api-platform-architecture.apply_in_work": "Aufbau einer skalierbaren, sicheren und konformen Infrastruktur für den API-Betrieb. Bereitstellung von Leitlinien für bewährte Architekturverfahren.",
  "station.api-platform-architecture.outcomes": "Redundante APIs abbauen und die Kosten für die Cloud-Plattform senken",
  "station.api-platform-architecture.how_it_works": "Das Business Impact Canvas hilft dabei, Risiken in Bezug auf API-Verfügbarkeit, -Sicherheit und -Funktionalität zu identifizieren und zu mindern, um fundierte Architekturentscheidungen zu unterstützen.",
  "station.api-design.title": "API-Design - Entwerfen Sie APIs, die Wert liefern",
  "station.api-design.description": "Erstellen Sie durchdachte API-Entwürfe, die sich an den Bedürfnissen der Benutzer, den Produktzielen und konsistenten Spezifikationen orientieren.",
  "station.api-design.why_it_matters": "Beim Entwurf von APIs geht es nicht nur um die Benennung von Endpunkten. Ein gutes Design stellt sicher, dass APIs benutzbar und konsistent sind und mit den geschäftlichen und technischen Zielen übereinstimmen. Schlecht konzipierte APIs führen zu technischen Schulden, schlechter Akzeptanz und Nacharbeit in den Teams.",
  "station.api-design.apply_in_work": "Bereitstellung von wiederverwendbaren Vorlagen, Standards und Validierungstools für API-Spezifikationen. Sicherstellen, dass die Teams Design-Reviews befolgen und Feedback frühzeitig einbeziehen.",
  "station.api-design.outcomes": "Gut dokumentierte und konsistente API-Designs",
  "station.api-design.how_it_works": "Definieren Sie zentrale Entitäten, ihre Attribute und Beziehungen, um ein gemeinsames konzeptionelles Verständnis für alle APIs zu schaffen.",
  "station.api-delivery.title": "API-Bereitstellung - Bereitstellung sicherer und zuverlässiger APIs",
  "station.api-delivery.description": "Erstellen, Testen und Freigeben von APIs unter Verwendung moderner Bereitstellungspipelines und bewährter technischer Verfahren.",
  "station.api-delivery.why_it_matters": "Selbst die besten API-Designs scheitern, wenn die Bereitstellung uneinheitlich ist. Diese Station stellt sicher, dass Ihre APIs qualitativ hochwertig erstellt, gründlich getestet und zuverlässig bereitgestellt werden - für schnellere Iterationen und mehr Vertrauen.",
  "station.api-delivery.apply_in_work": "Bereitstellung von Kodierungsrahmen, Bibliotheken und Standards für die API-Implementierung. Implementierung von CI/CD-Pipelines, Qualitätssicherungs-Frameworks und Tools zur Automatisierung der Bereitstellung.",
  "station.api-delivery.outcomes": "APIs, die mit getesteten Frameworks und Mustern implementiert werden",
  "station.api-delivery.how_it_works": "Verwendung etablierter Frameworks und Bibliotheken zur Implementierung von APIs, um sicherzustellen, dass sie wiederverwendbar und wartbar sind.",
  "station.api-audit.title": "API-Audit - Prüfung von APIs auf Konformität und Qualität",
  "station.api-audit.description": "Überprüfen Sie vor der Veröffentlichung, ob APIs den organisatorischen, technischen und rechtlichen Standards entsprechen.",
  "station.api-audit.why_it_matters": "APIs sind langlebige Produkte und müssen die Erwartungen an Qualität, Konsistenz und Compliance erfüllen. Audits verringern Risiken, verhindern, dass Mängel in die Produktion gelangen, und unterstützen externe Zertifizierungen.",
  "station.api-audit.apply_in_work": "Schaffung von Governance-Frameworks und -Tools für die Validierung von API-Konformität, Leistung und Sicherheit. Überwachen Sie, dass APIs die Validierungskriterien erfüllen.",
  "station.api-audit.outcomes": "APIs erfüllen interne und externe Standards",
  "station.api-audit.how_it_works": "Führen Sie Audits durch, um sicherzustellen, dass APIs vor der Veröffentlichung organisatorische, technische und rechtliche Standards erfüllen.",
  "station.api-publishing.title": "API-Veröffentlichung - Veröffentlichen Sie APIs mit Zuversicht",
  "station.api-publishing.description": "Stellen Sie APIs mit der richtigen Dokumentation und den richtigen Prozessen sicher und klar für die richtige Zielgruppe bereit.",
  "station.api-publishing.why_it_matters": "Bei der Veröffentlichung geht es nicht nur um die Bereitstellung, sondern auch um die Auffindbarkeit, den Zugang und die Unterstützung. Wenn APIs nicht korrekt veröffentlicht werden, können sie nicht verwendet, wiederverwendet oder effektiv gesichert werden.",
  "station.api-publishing.apply_in_work": "Ermöglichung der Veröffentlichung von APIs in der jeweiligen Umgebung mit klaren Registrierungs- und Zugriffsmechanismen (z. B. API-Schlüssel, OAuth, Abonnementpläne) je nach den API-Verbrauchersegmenten und den Sicherheits- und Compliance-Anforderungen.",
  "station.api-publishing.outcomes": "Veröffentlichung von APIs in der richtigen Umgebung (privat, Partner, öffentlich)",
  "station.api-publishing.how_it_works": "Veröffentlichen Sie APIs in den entsprechenden Gateways und Umgebungen, um die Wiederverwendbarkeit für mehrere API-Kunden zu unterstützen.",
  "station.monitoring-and-improving.title": "Überwachen und Verbessern - für den API-Wert",
  "station.monitoring-and-improving.description": "Nutzen Sie Messgrößen und Feedback, um die API-Leistung zu verfolgen und kontinuierliche Verbesserungen voranzutreiben.",
  "station.monitoring-and-improving.why_it_matters": "Die API-Bereitstellung endet nicht mit dem Start. Ohne Überwachung können Teams weder die Akzeptanz noch die Leistung oder den ROI verbessern. Diese Station stellt sicher, dass APIs nützlich und sicher bleiben und sich mit den Geschäftsanforderungen weiterentwickeln.",
  "station.monitoring-and-improving.apply_in_work": "Einrichtung von Analyserahmen zur Verfolgung von Leistung und Engagement. Entwickeln Sie Feedbackschleifen, Analysetools und Engagementstrategien für APIs.",
  "station.monitoring-and-improving.outcomes": "Festlegung und Verfolgung von Leistungs- und Nutzungskennzahlen",
  "station.monitoring-and-improving.how_it_works": "Überwachen Sie Leistungsmetriken (z. B. API-Aufrufe, Latenz, Fehlerraten) und Akzeptanzmetriken (z. B. NPS).",
  "station.user-experience.title": "Benutzerfreundlichkeit - Entwerfen Sie APIs mit dem Benutzer im Hinterkopf",
  "station.user-experience.description": "Stellen Sie sicher, dass die APIs mit Blick auf den Endnutzer entwickelt werden und eine nahtlose und intuitive Erfahrung bieten.",
  "station.user-experience.why_it_matters": "APIs sind nicht nur technische Produkte, sondern auch Produkte für die Benutzer. Ein schlechtes Benutzererlebnis kann zu geringer Akzeptanz und Frustration führen. Diese Station hilft Teams bei der Entwicklung von APIs, die benutzerfreundlich sind und die Bedürfnisse der Verbraucher erfüllen.",
  "station.user-experience.apply_in_work": "Bereitstellung von Richtlinien, Vorlagen und Tools für die Benutzererfahrung beim API-Design. Sicherstellen, dass die Teams nutzerzentrierte Designpraktiken befolgen und Nutzerfeedback in API-Iterationen einbeziehen.",
  "station.user-experience.outcomes": "APIs, die auf die Bedürfnisse der Nutzer abgestimmt sind",
  "station.user-experience.how_it_works": "Verwendung von User Personas, um die Bedürfnisse und Erwartungen der Endnutzer zu verstehen",
  "station.market-insights.title": "Markteinblicke - Verstehen Sie die API-Landschaft",
  "station.market-insights.description": "Analysieren Sie Markttrends, APIs von Mitbewerbern und Industriestandards, um eine API-Strategie zu entwickeln.",
  "station.market-insights.why_it_matters": "Das Verständnis der Marktlandschaft hilft Teams, Chancen zu erkennen, Fallstricke zu vermeiden und ihre APIs an Branchenstandards auszurichten. Diese Station bietet Tools zur Analyse von Markttrends und Angeboten von Wettbewerbern.",
  "station.market-insights.apply_in_work": "Bereitstellung von Marktforschungstools, Vorlagen für Konkurrenzanalysen und Ressourcen für Industriestandards. Sicherstellen, dass die Teams über Markttrends informiert bleiben und die Erkenntnisse in die API-Strategie einfließen.",
  "station.market-insights.outcomes": "Analyse von Markttrends und APIs von Wettbewerbern",
  "station.market-insights.how_it_works": "Führen Sie Marktforschung durch, um Trends, Chancen und Bedrohungen in der API-Landschaft zu identifizieren.",
  "station.business-goals.title": "Geschäftsziele - APIs an Geschäftszielen ausrichten",
  "station.business-goals.description": "Sicherstellen, dass die APIs mit den Geschäftszielen übereinstimmen und zu den allgemeinen Unternehmenszielen beitragen.",
  "station.business-goals.why_it_matters": "APIs sollten nicht isoliert entwickelt werden; sie müssen Geschäftsziele unterstützen und vorantreiben. Diese Station hilft Teams dabei, ihre APIs an strategischen Zielen auszurichten und sicherzustellen, dass sie einen echten Geschäftswert liefern.",
  "station.business-goals.apply_in_work": "Bereitstellung von Frameworks, Vorlagen und Tools für die Geschäftsausrichtung zur Definition des API-Geschäftswerts. Sicherstellen, dass die Teams die APIs regelmäßig überprüfen und mit den sich ändernden Geschäftszielen abstimmen.",
  "station.business-goals.outcomes": "APIs, die auf die Unternehmensziele abgestimmt sind",
  "station.business-goals.how_it_works": "Definieren Sie die Geschäftsziele und wie APIs diese unterstützen können, indem Sie **die Business Model Canvas** verwenden. Wenn Ihr Geschäft darin besteht, APIs bereitzustellen, gehen Sie durch *die API-Produktstrategie-Station* und füllen Sie **die API Business Model Canvas** aus.",
  "station.competitive-analysis.title": "Wettbewerbsanalyse - Vorsprung auf dem API-Markt",
  "station.competitive-analysis.description": "Analysieren Sie die APIs der Wettbewerber, um Stärken, Schwächen und Möglichkeiten zur Differenzierung zu ermitteln.",
  "station.competitive-analysis.why_it_matters": "Das Verständnis der Wettbewerbslandschaft hilft den Teams, Lücken, Möglichkeiten und verbesserungswürdige Bereiche für ihre APIs zu identifizieren. Diese Station bietet Tools zur Analyse von Wettbewerbern und zur Information über die API-Strategie.",
  "station.competitive-analysis.apply_in_work": "Bereitstellung von Tools, Vorlagen und Ressourcen zur Wettbewerbsanalyse. Sicherstellen, dass die Teams regelmäßig die Konkurrenz analysieren und die Erkenntnisse in die API-Strategie und das Design einfließen lassen.",
  "station.competitive-analysis.outcomes": "Analyse der Stärken und Schwächen von APIs der Wettbewerber",
  "station.competitive-analysis.how_it_works": "Führen Sie eine Wettbewerbsanalyse durch, um die wichtigsten Wettbewerber, ihre API-Angebote sowie ihre Stärken und Schwächen zu ermitteln.",
  "station.ecosystem-vision.title": "Ökosystem-Vision - Aufbau von APIs für ein florierendes Ökosystem",
  "station.ecosystem-vision.description": "Entwickeln Sie eine Vision dafür, wie Ihre APIs in ein größeres Ökosystem passen, das Zusammenarbeit und Innovation ermöglicht.",
  "station.ecosystem-vision.why_it_matters": "APIs sind keine eigenständigen Produkte; sie sind Teil eines größeren Ökosystems. Diese Station hilft Teams zu definieren, wie ihre APIs mit anderen Systemen, Plattformen und Diensten interagieren, um ein florierendes Ökosystem zu schaffen, das die Zusammenarbeit und Innovation fördert.",
  "station.ecosystem-vision.apply_in_work": "Bereitstellung von Rahmenwerken für die Vision des Ökosystems, Strategien für die Einbindung von Partnern und Integrationsrichtlinien. Sicherstellen, dass die Teams APIs mit Blick auf das Ökosystem entwickeln und die Zusammenarbeit zwischen den Partnern fördern.",
  "station.ecosystem-vision.outcomes": "Klare Vision eines Ökosystems für APIs definiert",
  "station.ecosystem-vision.how_it_works": "Definieren Sie die Vision des Ökosystems für Ihre APIs, einschließlich der Frage, wie sie mit anderen Systemen und Plattformen interagieren werden.",
  "station.scalable-infrastructure.title": "Skalierbare Infrastruktur - APIs auf einem soliden Fundament aufbauen",
  "station.scalable-infrastructure.description": "Stellen Sie sicher, dass Ihre API-Infrastruktur skalierbar ist, um der wachsenden Nachfrage gerecht zu werden und eine hohe Verfügbarkeit zu gewährleisten.",
  "station.scalable-infrastructure.why_it_matters": "APIs müssen auf einer robusten Infrastruktur aufgebaut werden, die den zunehmenden Datenverkehr bewältigen und eine hohe Verfügbarkeit gewährleisten kann. Diese Station bietet Richtlinien für den Entwurf und die Implementierung einer skalierbaren Infrastruktur, die das Wachstum und die Leistung von APIs unterstützt.",
  "station.scalable-infrastructure.apply_in_work": "Bereitstellung von Richtlinien für das Infrastrukturdesign, Cloud-nativen Mustern und Überwachungstools. Sicherstellen, dass die Teams eine skalierbare Infrastruktur implementieren, die sich an wechselnde Anforderungen anpassen kann und die API-Leistung unterstützt.",
  "station.scalable-infrastructure.outcomes": "Skalierbare und widerstandsfähige API-Infrastruktur",
  "station.scalable-infrastructure.how_it_works": "Entwerfen Sie eine skalierbare und robuste API-Infrastruktur unter Verwendung von Cloud-nativen Mustern und Technologien.",
  "station.legal-and-compliance.title": "Rechtliche Aspekte und Einhaltung von Vorschriften - Sicherstellen, dass APIs den regulatorischen Standards entsprechen",
  "station.legal-and-compliance.description": "Stellen Sie sicher, dass APIs den gesetzlichen und behördlichen Anforderungen entsprechen, um Ihr Unternehmen und Ihre Benutzer zu schützen.",
  "station.legal-and-compliance.why_it_matters": "APIs müssen gesetzliche und regulatorische Standards einhalten, um Ihr Unternehmen und Ihre Benutzer zu schützen. Diese Station bietet Tools und Richtlinien, die sicherstellen, dass APIs die Compliance-Anforderungen erfüllen, rechtliche Risiken verringern und den Datenschutz gewährleisten.",
  "station.legal-and-compliance.apply_in_work": "Bereitstellung von rechtlichen und Compliance-Rahmenwerken, Checklisten und Tools zur Gewährleistung der API-Compliance. Sicherstellen, dass die Teams die rechtlichen Anforderungen beim Entwurf, der Entwicklung und der Veröffentlichung von APIs verstehen und umsetzen.",
  "station.legal-and-compliance.outcomes": "APIs, die mit gesetzlichen und regulatorischen Standards übereinstimmen",
  "station.legal-and-compliance.how_it_works": "Identifizieren Sie rechtliche und regulatorische Anforderungen, die für Ihre APIs gelten, wie z. B. Datenschutz, Privatsphäre und Sicherheitsstandards.",
  "station.security-and-privacy.title": "Sicherheit und Datenschutz - Schützen Sie Ihre APIs und Benutzer",
  "station.security-and-privacy.description": "Implementierung von Sicherheits- und Datenschutzmaßnahmen zum Schutz von APIs und Nutzerdaten vor Bedrohungen und Verstößen.",
  "station.security-and-privacy.why_it_matters": "APIs sind anfällig für Sicherheitsbedrohungen und Datenschutzverletzungen. Diese Station bietet Richtlinien für die Implementierung von Sicherheits- und Datenschutzmaßnahmen, die APIs und Nutzerdaten schützen und Vertrauen und Compliance gewährleisten.",
  "station.security-and-privacy.apply_in_work": "Bereitstellung von Sicherheits-Frameworks, Tools und Best Practices für API-Sicherheit und Datenschutz. Sicherstellen, dass die Teams Sicherheitsmaßnahmen während des gesamten API-Lebenszyklus implementieren, vom Entwurf bis zur Veröffentlichung und Überwachung.",
  "station.security-and-privacy.outcomes": "Gegen Bedrohungen und Schwachstellen gesicherte APIs",
  "station.security-and-privacy.how_it_works": "Implementieren Sie Sicherheitsmaßnahmen wie Authentifizierung, Autorisierung, Verschlüsselung und Ratenbegrenzung, um APIs vor Bedrohungen zu schützen.",
  "station.design-standards.title": "Designstandards - Sicherstellung eines konsistenten und qualitativ hochwertigen API-Designs",
  "station.design-standards.description": "Festlegung von Designstandards und -richtlinien, um ein einheitliches und hochwertiges API-Design im gesamten Unternehmen zu gewährleisten.",
  "station.design-standards.why_it_matters": "Ein konsistentes und qualitativ hochwertiges API-Design ist für die Benutzerfreundlichkeit, Wartbarkeit und Skalierbarkeit unerlässlich. Diese Station bietet Designstandards und Richtlinien, die Teams bei der Erstellung von APIs helfen, die einfach zu verwenden, zu verstehen und zu warten sind.",
  "station.design-standards.apply_in_work": "Bereitstellung von Dokumentationen zu Designstandards, wiederverwendbaren Komponenten und Designüberprüfungsprozessen. Sicherstellen, dass die Teams die Designstandards befolgen und regelmäßige Überprüfungen durchführen, um ein qualitativ hochwertiges API-Design zu gewährleisten.",
  "station.design-standards.outcomes": "Einheitliches API-Design in der gesamten Organisation",
  "station.design-standards.how_it_works": "Definition von Designstandards und Richtlinien für das API-Design, einschließlich Benennungskonventionen, Antwortformaten und Fehlerbehandlung.",
  "station.vendor-management.title": "Vendor Management - Verwalten von API-Integrationen von Drittanbietern",
  "station.vendor-management.description": "Effiziente Verwaltung von Drittanbieter-APIs und Integrationen zur Gewährleistung von Zuverlässigkeit und Konformität.",
  "station.vendor-management.why_it_matters": "APIs von Drittanbietern können Risiken und Abhängigkeiten mit sich bringen, die sich auf Ihr API-Ökosystem auswirken. Diese Station enthält Richtlinien für die Verwaltung von Anbieterbeziehungen, die Zuverlässigkeit, Konformität und Übereinstimmung mit Ihrer API-Strategie sicherstellen.",
  "station.vendor-management.apply_in_work": "Bereitstellung von Rahmenwerken für die Anbieterverwaltung, Bewertungskriterien und Überwachungsinstrumenten. Sicherstellen, dass die Teams API-Anbieter von Drittanbietern effektiv verwalten, um Zuverlässigkeit, Konformität und Übereinstimmung mit den Unternehmensstandards zu gewährleisten.",
  "station.vendor-management.outcomes": "Effektive Prozesse für das Lieferantenmanagement eingeführt",
  "station.vendor-management.how_it_works": "Einführung von Prozessen für das Anbietermanagement, um Drittanbieter von APIs zu bewerten, einzubinden und zu überwachen.",
  "station.contract-design.title": "Vertragsgestaltung - Definieren Sie klare API-Verträge",
  "station.contract-design.description": "Erstellen Sie klare und genau definierte API-Verträge, die Erwartungen, Verantwortlichkeiten und Nutzungsrichtlinien umreißen.",
  "station.contract-design.why_it_matters": "API-Verträge sind wichtig, um Klarheit und Übereinstimmung zwischen API-Anbietern und Kunden zu gewährleisten. Diese Station bietet Richtlinien für die Gestaltung von API-Verträgen, die klar, umfassend und leicht verständlich sind.",
  "station.contract-design.apply_in_work": "Bereitstellung von Vertragsentwurfsvorlagen, standardisierten Formaten und Überprüfungsprozessen. Sicherstellen, dass Teams klare und gut definierte API-Verträge erstellen, die Erwartungen, Verantwortlichkeiten und Nutzungsrichtlinien umreißen.",
  "station.contract-design.outcomes": "Klare API-Verträge für jede API definiert",
  "station.contract-design.how_it_works": "Definieren Sie API-Verträge, in denen die Erwartungen, Verantwortlichkeiten und Nutzungsrichtlinien für jede API festgelegt sind.",
  "station.development.title": "Entwicklung - Erstellen von APIs mit bewährten Praktiken",
  "station.development.description": "Implementierung von APIs unter Verwendung von Best Practices und Frameworks zur Gewährleistung von Qualität, Wartbarkeit und Skalierbarkeit.",
  "station.development.why_it_matters": "Die API-Entwicklung ist eine entscheidende Phase, die die Qualität und Zuverlässigkeit der API bestimmt. Diese Station bietet Best Practices und Frameworks für die API-Entwicklung, die sicherstellen, dass APIs nach hohen Standards erstellt werden und effektiv gewartet und skaliert werden können.",
  "station.development.apply_in_work": "Bereitstellung von Entwicklungsrahmen, Bibliotheken und Codierungsstandards für die API-Implementierung. Sicherstellen, dass die Teams Best Practices befolgen und Code-Reviews durchführen, um eine hochwertige API-Entwicklung zu gewährleisten.",
  "station.development.outcomes": "APIs, die unter Verwendung bewährter Verfahren und Rahmenwerke entwickelt werden",
  "station.development.how_it_works": "Verwendung etablierter Frameworks und Bibliotheken zur Implementierung von APIs, um sicherzustellen, dass sie wiederverwendbar und wartbar sind.",
  "station.ci-cd.title": "CI/CD - Automatisierte API-Bereitstellung",
  "station.ci-cd.description": "Implementieren Sie Pipelines für kontinuierliche Integration und kontinuierliche Bereitstellung (CI/CD), um die API-Bereitstellung zu automatisieren und eine gleichbleibende Qualität zu gewährleisten.",
  "station.ci-cd.why_it_matters": "CI/CD ist wichtig, um sicherzustellen, dass APIs schnell, zuverlässig und in hoher Qualität bereitgestellt werden. Diese Station bietet Richtlinien für die Implementierung von CI/CD-Pipelines, die die Build-, Test- und Bereitstellungsprozesse für APIs automatisieren.",
  "station.ci-cd.apply_in_work": "Bereitstellung von CI/CD-Frameworks, Tools und Best Practices für die API-Bereitstellung. Sicherstellen, dass Teams automatisierte Pipelines implementieren, die die kontinuierliche Integration, Prüfung und Bereitstellung von APIs unterstützen.",
  "station.ci-cd.outcomes": "Automatisierte CI/CD-Pipelines für die API-Bereitstellung eingerichtet",
  "station.ci-cd.how_it_works": "Verwenden Sie CI/CD-Pipelines, um Build-, Test- und Bereitstellungsprozesse zu automatisieren und so konsistente Qualität und Nachvollziehbarkeit zu gewährleisten.",
  "station.test-automation.title": "Testautomatisierung - Sicherung der API-Qualität",
  "station.test-automation.description": "Implementieren Sie automatisierte Testverfahren, um die Qualität, Zuverlässigkeit und Leistung von APIs sicherzustellen.",
  "station.test-automation.why_it_matters": "Automatisierte Tests sind entscheidend, um sicherzustellen, dass APIs korrekt funktionieren und den Qualitätsstandards entsprechen. Diese Station bietet Richtlinien für die Implementierung automatisierter Testverfahren, die funktionale, Sicherheits- und Leistungstests für APIs umfassen.",
  "station.test-automation.apply_in_work": "Bereitstellung von Testautomatisierungs-Frameworks, Tools und Best Practices für API-Tests. Sicherstellen, dass Teams automatisierte Tests implementieren, die funktionale, Sicherheits- und Leistungsaspekte von APIs abdecken.",
  "station.test-automation.outcomes": "Automatisierte Testverfahren für APIs implementiert",
  "station.test-automation.how_it_works": "Verwenden Sie automatisierte Testtools, um API-Funktionalität, Sicherheit und Leistung zu validieren.",
  "station.release-management.title": "Release Management - Effektive Verwaltung von API-Releases",
  "station.release-management.description": "Implementierung von Release-Management-Verfahren zur Gewährleistung reibungsloser und kontrollierter API-Releases.",
  "station.release-management.why_it_matters": "Ein effektives Versionsmanagement ist unerlässlich, um sicherzustellen, dass API-Versionen reibungslos, kontrolliert und auf die Geschäftsanforderungen abgestimmt sind. Diese Station bietet Richtlinien für die Verwaltung von API-Releases, einschließlich Versionierung, Bereitstellungsstrategien und Rollback-Verfahren.",
  "station.release-management.apply_in_work": "Bereitstellung von Rahmenwerken für die Versionsverwaltung, Richtlinien für die Versionierung und Strategien für die Bereitstellung. Sicherstellen, dass die Teams Best Practices für die Verwaltung von API-Releases befolgen, einschließlich Versionierung, Bereitstellung und Rollback-Verfahren.",
  "station.release-management.outcomes": "Kontrollierte und reibungslose API-Freigaben",
  "station.release-management.how_it_works": "Definieren Sie Versionsstrategien für APIs, um Änderungen zu verwalten und Abwärtskompatibilität zu gewährleisten.",
  "station.service-agreements.title": "Servicevereinbarungen - Definieren Sie API-Service-Levels",
  "station.service-agreements.description": "Erstellen Sie Dienstleistungsvereinbarungen, in denen die Erwartungen, das Leistungsniveau und die Zuständigkeiten von API-Anbietern und Kunden festgelegt sind.",
  "station.service-agreements.why_it_matters": "Dienstleistungsvereinbarungen sind wichtig, um Klarheit und Übereinstimmung zwischen API-Anbietern und Kunden zu gewährleisten. Diese Station bietet Richtlinien für die Erstellung von Servicevereinbarungen, die Erwartungen, Servicelevel und Verantwortlichkeiten umreißen und so Missverständnisse und Streitigkeiten reduzieren.",
  "station.service-agreements.apply_in_work": "Bereitstellung von Vorlagen für Servicevereinbarungen, standardisierten Formaten und Überprüfungsprozessen. Stellen Sie sicher, dass die Teams klare und genau definierte Servicevereinbarungen erstellen, in denen die Erwartungen, Servicelevel und Verantwortlichkeiten für API-Anbieter und -Kunden festgelegt sind.",
  "station.service-agreements.outcomes": "Klare Dienstvereinbarungen für jede API definiert",
  "station.service-agreements.how_it_works": "Definieren Sie Servicevereinbarungen, in denen die Erwartungen, Servicelevel und Verantwortlichkeiten für jede API festgelegt sind.",
  "station.api-consumer-adoption.title": "API-Verbraucherakzeptanz - Förderung der API-Nutzung",
  "station.api-consumer-adoption.description": "Implementierung von Strategien zur Förderung der Akzeptanz und des Engagements von API-Kunden, um sicherzustellen, dass APIs effektiv genutzt werden.",
  "station.api-consumer-adoption.why_it_matters": "Die Förderung der Akzeptanz von APIs durch die Verbraucher ist entscheidend für die Realisierung des Werts von APIs. Diese Station bietet Strategien und Best Practices für die Einbindung von API-Nutzern, um sicherzustellen, dass sie verstehen, wie APIs effektiv genutzt werden können und einen Nutzen aus ihnen ziehen.",
  "station.api-consumer-adoption.apply_in_work": "Bereitstellung von Onboarding-Ressourcen, Lehrmaterial und Strategien zur Einbindung von API-Kunden. Sicherstellen, dass die Teams Strategien umsetzen, die die Akzeptanz, das Engagement und die Zufriedenheit der API-Kunden fördern.",
  "station.api-consumer-adoption.outcomes": "Strategien zur Übernahme von API durch die Verbraucher umgesetzt",
  "station.api-consumer-adoption.how_it_works": "Entwicklung von Onboarding-Prozessen und -Ressourcen, damit API-Kunden verstehen, wie sie APIs effektiv nutzen können.",
  "station.api-promotion.title": "API-Promotion - Erhöhen Sie die Sichtbarkeit und Nutzung von APIs",
  "station.api-promotion.description": "Förderung von APIs, um die Sichtbarkeit, Nutzung und Akzeptanz bei den Zielgruppen zu erhöhen.",
  "station.api-promotion.why_it_matters": "Die Förderung von APIs ist wichtig, um ihre Sichtbarkeit zu erhöhen und ihre Nutzung zu fördern. Diese Station bietet Strategien und Best Practices für eine effektive Werbung für APIs bei den Zielgruppen, um sicherzustellen, dass diese die APIs kennen und ihren Wert verstehen.",
  "station.api-promotion.apply_in_work": "Bereitstellung von Marketingstrategien, Werbematerialien und Ressourcen für das Engagement in der Gemeinschaft. Sicherstellen, dass die Teams effektive API-Werbestrategien umsetzen, die die Sichtbarkeit, Nutzung und Akzeptanz bei den Zielgruppen erhöhen.",
  "station.api-promotion.outcomes": "Umgesetzte API-Förderstrategien",
  "station.api-promotion.how_it_works": "Entwickeln Sie Marketingstrategien, um APIs bei den Zielgruppen bekannt zu machen, einschließlich sozialer Medien, Blogs und Webinare.",
  "station.partner-integration.title": "Partnerintegration - Zusammenarbeit mit Partnern",
  "station.partner-integration.description": "Erleichtern Sie die Integration von Partnern, um die API-Funktionen zu verbessern und die Reichweite zu erhöhen.",
  "station.partner-integration.why_it_matters": "Die Integration von Partnern kann die API-Funktionen verbessern und die Reichweite erhöhen. Diese Station enthält Richtlinien für die Zusammenarbeit mit Partnern zur Integration ihrer APIs, um nahtlose Interoperabilität und Wertschöpfung zu gewährleisten.",
  "station.partner-integration.apply_in_work": "Bereitstellung von Frameworks, Richtlinien und Überwachungstools für die Partnerintegration. Sicherstellen, dass die Teams effektiv mit Partnern zusammenarbeiten, um die API-Funktionen zu verbessern, die Reichweite zu erhöhen und Innovationen voranzutreiben.",
  "station.partner-integration.outcomes": "Prozesse zur Partnerintegration etabliert",
  "station.partner-integration.how_it_works": "Identifizieren Sie potenzielle Partner, deren APIs Ihre API-Fähigkeiten und Ihr Wertversprechen verbessern können.",
  "station.api-mindset.title": "API-Mentalität - Fördern Sie eine API-First-Kultur",
  "station.api-mindset.description": "Fördern Sie eine API-zentrierte Denkweise im gesamten Unternehmen, um Innovation und Zusammenarbeit voranzutreiben.",
  "station.api-mindset.why_it_matters": "Eine API-zentrierte Denkweise ist entscheidend für die Förderung von Innovation und Zusammenarbeit im gesamten Unternehmen. Diese Station bietet Strategien für die Kultivierung einer API-first-Kultur, die sicherstellt, dass APIs als strategische Assets betrachtet werden, die den Geschäftswert steigern.",
  "station.api-mindset.apply_in_work": "Bereitstellung von Schulungsprogrammen, Ressourcen und Kommunikationsstrategien zur Förderung einer API-zentrierten Kultur. Sicherstellen, dass die Teams den Wert von APIs verstehen und befähigt werden, die API-Strategie und -Initiativen voranzutreiben.",
  "station.api-mindset.outcomes": "Einführung einer API-zentrierten Kultur im gesamten Unternehmen",
  "station.api-mindset.how_it_works": "Förderung des Wertes von APIs als strategische Ressourcen, die den Geschäftswert und die Innovation vorantreiben.",
  "station.roles-and-responsibilities.title": "Rollen und Zuständigkeiten - API-Team-Strukturen definieren",
  "station.roles-and-responsibilities.description": "Definieren Sie klare Rollen und Verantwortlichkeiten für API-Teams, um eine effektive Zusammenarbeit und Verantwortlichkeit zu gewährleisten.",
  "station.roles-and-responsibilities.why_it_matters": "Klare Rollen und Zuständigkeiten sind für eine effektive Zusammenarbeit und Verantwortlichkeit in API-Teams unerlässlich. Diese Station bietet Richtlinien für die Definition von Teamstrukturen, Rollen und Verantwortlichkeiten, um sicherzustellen, dass jeder seinen Beitrag zu API-Initiativen versteht.",
  "station.roles-and-responsibilities.apply_in_work": "Bereitstellung von Richtlinien für die Teamstruktur, Rollendefinitionen und Kommunikationsstrategien. Stellen Sie sicher, dass Teams klare Rollen und Verantwortlichkeiten haben, die eine effektive Zusammenarbeit und Verantwortlichkeit bei API-Initiativen fördern.",
  "station.roles-and-responsibilities.outcomes": "Klare Rollen und Verantwortlichkeiten für API-Teams definiert",
  "station.roles-and-responsibilities.how_it_works": "Definieren Sie Teamstrukturen und Rollen für API-Teams, einschließlich API-Produktverantwortliche, Entwickler, Architekten und Betriebsleiter.",
  "station.upskilling.title": "Upskilling - Erweiterung der API-Fähigkeiten und -Kenntnisse",
  "station.upskilling.description": "Bereitstellung von Schulungen und Ressourcen zur Verbesserung der API-Fähigkeiten und -Kenntnisse in der gesamten Organisation.",
  "station.upskilling.why_it_matters": "Kontinuierliches Lernen und Weiterbildung sind unerlässlich, um API-Teams mit den neuesten Technologien, Praktiken und Trends auf dem Laufenden zu halten. Diese Station bietet Schulungsprogramme und Ressourcen zur Verbesserung der API-Fähigkeiten und -Kenntnisse, um sicherzustellen, dass die Teams für die Bereitstellung hochwertiger APIs gerüstet sind.",
  "station.upskilling.apply_in_work": "Bereitstellung von Schulungsprogrammen, Ressourcen und Bewertungsinstrumenten zur Verbesserung der API-Fähigkeiten und -Kenntnisse. Sicherstellen, dass Teams Zugang zu kontinuierlichen Lernmöglichkeiten haben, die sie befähigen, API-Innovation und Qualität voranzutreiben.",
  "station.upskilling.outcomes": "Verbesserung der API-Fähigkeiten und -Kenntnisse in der gesamten Organisation",
  "station.upskilling.how_it_works": "Identifizieren Sie wichtige API-Fähigkeiten und Wissensbereiche, die verbessert werden müssen, wie z. B. API-Design, Sicherheit und Leistung.",
  "station.operating-guidelines.title": "Betriebsleitlinien - Einrichtung einer API-Governance",
  "station.operating-guidelines.description": "Festlegung von Betriebsrichtlinien und Governance-Praktiken zur Gewährleistung einer einheitlichen API-Verwaltung und -Qualität.",
  "station.operating-guidelines.why_it_matters": "Eine effektive API-Governance ist für die Sicherstellung einer konsistenten API-Verwaltung, Qualität und Compliance unerlässlich. Diese Station bietet Betriebsrichtlinien und Governance-Praktiken, die Teams bei der effektiven Verwaltung von APIs helfen und sicherstellen, dass diese mit den Unternehmensstandards und Best Practices übereinstimmen.",
  "station.operating-guidelines.apply_in_work": "Bereitstellung von Betriebsrichtlinien, Governance-Frameworks und Überwachungstools für die API-Verwaltung. Sicherstellen, dass Teams etablierte Praktiken befolgen, die eine konsistente API-Verwaltung, Qualität und die Einhaltung von Unternehmensstandards fördern.",
  "station.operating-guidelines.outcomes": "API-Governance-Verfahren eingeführt",
  "station.operating-guidelines.how_it_works": "Definieren Sie Betriebsrichtlinien auf der Grundlage von APIOps-Zyklen, die die Prozesse, Standards und bewährten Verfahren für die API-Verwaltung umreißen.",
  "station.portfolio-management.title": "Portfoliomanagement - Effektive Verwaltung des API-Portfolios",
  "station.portfolio-management.description": "Effiziente Verwaltung des API-Portfolios, um die Übereinstimmung mit den Geschäftszielen und strategischen Initiativen zu gewährleisten.",
  "station.portfolio-management.why_it_matters": "Eine effektive Verwaltung des API-Portfolios ist unerlässlich, um sicherzustellen, dass APIs mit den Geschäftszielen und strategischen Initiativen übereinstimmen. Diese Station bietet Richtlinien für die Verwaltung des API-Portfolios und stellt sicher, dass APIs priorisiert, überwacht und optimiert werden, um maximalen Wert zu liefern.",
  "station.portfolio-management.apply_in_work": "Bereitstellung von Rahmenwerken für das Portfoliomanagement, Priorisierungskriterien und Überwachungstools für das API-Management. Sicherstellen, dass die Teams das API-Portfolio effektiv verwalten und dabei die Ausrichtung an Geschäftszielen und strategischen Initiativen sowie die Bereitstellung eines maximalen Werts gewährleisten.",
  "station.portfolio-management.outcomes": "Einführung von API-Portfolioverwaltungspraktiken",
  "station.portfolio-management.how_it_works": "Definition von Portfoliomanagementverfahren, die die Prozesse zur Verwaltung des API-Portfolios, einschließlich Priorisierung, Überwachung und Optimierung, umreißen.",
  "station.budget-and-resource-management.title": "Budget- und Ressourcenmanagement - Optimierung von API-Investitionen",
  "station.budget-and-resource-management.description": "Optimieren Sie das Budget- und Ressourcenmanagement für API-Initiativen, um eine effektive Investition und Ressourcenzuweisung zu gewährleisten.",
  "station.budget-and-resource-management.why_it_matters": "Ein effektives Budget- und Ressourcenmanagement ist unerlässlich, um sicherzustellen, dass API-Initiativen gut finanziert und mit Ressourcen ausgestattet sind. Diese Station bietet Richtlinien für die Optimierung der Budget- und Ressourcenverwaltung, um sicherzustellen, dass API-Initiativen mit den Unternehmenszielen übereinstimmen und maximalen Wert liefern.",
  "station.budget-and-resource-management.apply_in_work": "Bereitstellung von Rahmenwerken für die Budgetverwaltung, Priorisierungskriterien und Überwachungsinstrumenten für API-Initiativen. Sicherstellen, dass die Teams Budgets und Ressourcen effektiv verwalten und die Investitionen in die API-Entwicklung und -Verwaltung optimieren, um einen maximalen Nutzen zu erzielen.",
  "station.budget-and-resource-management.outcomes": "Budget- und Ressourcenmanagementverfahren für API-Initiativen eingeführt",
  "station.budget-and-resource-management.how_it_works": "Definieren Sie Budget- und Ressourcenverwaltungspraktiken, die die Prozesse für die Verwaltung von Budgets und Ressourcen für API-Initiativen umreißen.",
  "station.api-product-strategy.outcomes.1": "Gemeinsame Sprache zwischen Produkt, Design und Technik",
  "station.api-product-strategy.outcomes.2": "Ein solides Argument für die Finanzierung/Bewilligung",
  "station.api-product-strategy.how_it_works.1": "Definieren Sie zentrale Entitäten, ihre Attribute und Beziehungen, um ein gemeinsames konzeptionelles Verständnis für alle Journeys und eventuell APIs zu schaffen.",
  "station.api-product-strategy.how_it_works.2": "Identifizieren Sie die Bedürfnisse der Entwickler und neue oder wiederverwendbare APIs mithilfe des API Value Proposition Canvas.",
  "station.api-product-strategy.how_it_works.3": "Definieren Sie den Wert - für die Nutzer und das Unternehmen - mit dem API Business Model Canvas, um Ihre API-Strategie visuell, gemeinsam nutzbar und einfach mit Ihren API-Kunden an der nächsten Station zu validieren.",
  "station.api-consumer-experience.outcomes.1": "Definieren Sie die API-Erlebnisreise",
  "station.api-consumer-experience.outcomes.2": "Onboarding, Dokumentation und Feedback planen",
  "station.api-consumer-experience.outcomes.3": "Verbesserung der Akzeptanz durch echte Empathie + Developer Experience (DX)",
  "station.api-platform-architecture.outcomes.1": "Umsetzung einer einheitlichen Governance ohne starke Kontrolle von oben nach unten",
  "station.api-platform-architecture.outcomes.2": "Design für interne Wiederverwendung und externe Skalierbarkeit",
  "station.api-platform-architecture.how_it_works.1": "Kartierung der Standorte von API-Anbietern und -Verbrauchern, um die Zugänglichkeit und Einhaltung von Vorschriften zu gewährleisten.",
  "station.api-platform-architecture.how_it_works.2": "Das Capacity Canvas gleicht geschäftliche Transaktionsmuster, künftige Verbrauchstrends und technische Lösungen ab, um die Skalierbarkeit und Leistung von APIs zu gewährleisten und liefert wichtige Informationen für Skalierungsentscheidungen und die Infrastrukturplanung.",
  "station.api-platform-architecture.how_it_works.3": "Definieren und überwachen Sie Leistungsmetriken (z. B. API-Aufrufe, Latenz, Fehlerraten) und Adoptionsmetriken (z. B. NPS).",
  "station.api-design.outcomes.1": "Wiederverwendbare und validierte API-Verträge",
  "station.api-design.outcomes.2": "Entwürfe, die auf Domänenmodelle und Interaktionsmuster abgestimmt sind",
  "station.api-design.outcomes.3": "Rückverfolgbarkeit des Designs zum Geschäftswert",
  "station.api-design.how_it_works.1": "Verwenden Sie das Interaction Canvas, um zu definieren, wie die Verbraucher mit der API interagieren werden, um sicherzustellen, dass sie ihren Bedürfnissen und Erwartungen entspricht.",
  "station.api-design.how_it_works.2": "Wenden Sie REST-Entwurfsmuster an, um konsistente, wiederverwendbare API-Verträge zu erstellen, die mit den Beteiligten validiert werden.",
  "station.api-design.how_it_works.3": "Wenden Sie ereignisgesteuerte Entwurfsmuster an, um konsistente, wiederverwendbare API-Verträge zu erstellen, die mit den Beteiligten validiert werden.",
  "station.api-design.how_it_works.4": "Wenden Sie GraphQL-Designmuster an, um konsistente, wiederverwendbare API-Verträge zu erstellen, die mit den Beteiligten validiert werden.",
  "station.api-design.how_it_works.5": "Nutzen Sie die Erkenntnisse, um APIs zu entwickeln, die den Bedürfnissen der Verbraucher entsprechen, und stellen Sie sicher, dass sie auffindbar, verständlich und nutzbar sind.",
  "station.api-design.how_it_works.6": "Verwenden Sie die API-Audit-Checkliste, um sicherzustellen, dass der API-Entwurf die funktionalen und nicht-funktionalen Anforderungen erfüllt, einschließlich Sicherheit, Leistung und Compliance.",
  "station.api-delivery.outcomes.1": "Zuverlässige und automatisierte CI/CD-Pipelines",
  "station.api-delivery.outcomes.2": "Funktionale und nicht-funktionale Tests integriert",
  "station.api-delivery.outcomes.3": "Sichere und gesetzeskonforme Zustellungspipelines",
  "station.api-delivery.how_it_works.1": "Wenden Sie Contract-First- oder Design-First-Ansätze an, um sicherzustellen, dass API-Verträge vor der Implementierung validiert werden.",
  "station.api-delivery.how_it_works.2": "Testen Sie APIs auf Funktionalität, Sicherheit und Leistung mit automatisierten Testwerkzeugen.",
  "station.api-delivery.how_it_works.3": "Verwenden Sie CI/CD-Pipelines, um Build-, Test- und Bereitstellungsprozesse zu automatisieren und so konsistente Qualität und Nachvollziehbarkeit zu gewährleisten.",
  "station.api-delivery.how_it_works.4": "Stellen Sie sicher, dass APIs die Sicherheits- und Compliance-Anforderungen durch automatische Prüfungen und Audits erfüllen.",
  "station.api-delivery.how_it_works.5": "Verwenden Sie die API-Audit-Checkliste, um sicherzustellen, dass die API die funktionalen und nicht-funktionalen Anforderungen erfüllt, einschließlich Sicherheit, Leistung und Compliance.",
  "station.api-audit.outcomes.1": "Klare Dokumentation des API-Designs und der Implementierungsentscheidungen",
  "station.api-audit.outcomes.2": "Sicherheit, Leistung und Konformität validiert",
  "station.api-audit.outcomes.3": "Geringeres Risiko von Problemen in der Produktion",
  "station.api-audit.how_it_works.1": "Verwenden Sie Checklisten, Linters und Testwerkzeuge, um die Konsistenz und Konformität mit den Standards zu überprüfen.",
  "station.api-audit.how_it_works.2": "Zusammenarbeit mit Governance-Teams und Domänenexperten, um sicherzustellen, dass APIs für die Produktion bereit sind.",
  "station.api-publishing.outcomes.1": "Klare API-Einführungs- und Registrierungsprozesse",
  "station.api-publishing.outcomes.2": "Dokumentation, Sicherheitsmodelle und Richtlinien verfügbar",
  "station.api-publishing.outcomes.3": "APIs bereit für Skalierung und Governance",
  "station.api-publishing.how_it_works.1": "Dokumentieren Sie, wie die Verbraucher die API finden und nutzen, einschließlich Onboarding-Prozesse und Registrierung.",
  "station.api-publishing.how_it_works.2": "Stellen Sie sicher, dass die Sicherheitsmodelle, die Gateway-Konfiguration und die rechtlichen Bestimmungen für die Verbraucher klar und verständlich sind.",
  "station.monitoring-and-improving.outcomes.1": "Feedback-Schleifen für Entwickler sind vorhanden",
  "station.monitoring-and-improving.outcomes.2": "Kontinuierlich ermittelte und behandelte Probleme",
  "station.monitoring-and-improving.outcomes.3": "Iteration der API, abgestimmt auf die Bedürfnisse der Nutzer",
  "station.monitoring-and-improving.how_it_works.1": "Analysieren Sie API-Nutzungsmetriken und integrieren Sie Benutzerfeedback in API-Iterationen.",
  "station.monitoring-and-improving.how_it_works.2": "Machen Sie es sich zur Gewohnheit, die Messwerte zu überprüfen und kontinuierliche Verbesserungsmaßnahmen zu planen.",
  "station.user-experience.outcomes.1": "Intuitive und einheitliche Benutzeroberflächen",
  "station.user-experience.outcomes.2": "Nutzer-Feedback in API-Design integriert",
  "station.user-experience.outcomes.3": "Verbesserte Nutzerzufriedenheit und Akzeptanz",
  "station.user-experience.how_it_works.1": "Führen Sie Nutzerforschung durch, um Erkenntnisse darüber zu gewinnen, wie die Verbraucher mit den Ökosystemdiensten oder Ihren API nutzenden Anwendungen interagieren.",
  "station.user-experience.how_it_works.2": "Dokumentieren Sie die Anforderungen an die Benutzererfahrung, damit sie beim API-Design verwendet werden können, um sicherzustellen, dass sie intuitiv und einfach zu bedienen sind.",
  "station.market-insights.outcomes.1": "Ermittlung von Industriestandards und bewährten Verfahren",
  "station.market-insights.outcomes.2": "API-Strategie auf die Bedürfnisse des Marktes abgestimmt",
  "station.market-insights.outcomes.3": "Fundierte Entscheidungsfindung auf der Grundlage von Marktkenntnissen",
  "station.market-insights.how_it_works.1": "Analysieren Sie die APIs der Mitbewerber, um deren Stärken, Schwächen und Alleinstellungsmerkmale zu verstehen.",
  "station.market-insights.how_it_works.2": "Ermittlung von Industriestandards und bewährten Verfahren, um sicherzustellen, dass APIs wettbewerbsfähig und konform sind.",
  "station.business-goals.outcomes.1": "Klarer Geschäftswert für jede API definiert",
  "station.business-goals.outcomes.2": "Akzeptanz und Unterstützung von API-Initiativen durch die Interessengruppen",
  "station.business-goals.outcomes.3": "APIs tragen zum Unternehmenserfolg bei",
  "station.business-goals.how_it_works.1": "Identifizieren Sie wichtige Leistungsindikatoren (KPIs), um den API-Erfolg anhand der Unternehmensziele zu messen.",
  "station.business-goals.how_it_works.2": "Einbindung von Interessengruppen, um die Abstimmung und Unterstützung von API-Initiativen sicherzustellen.",
  "station.competitive-analysis.outcomes.1": "Möglichkeiten zur Differenzierung identifiziert",
  "station.competitive-analysis.outcomes.2": "API-Strategie auf der Grundlage von Erkenntnissen über den Wettbewerb",
  "station.competitive-analysis.outcomes.3": "Gesteigerte Wettbewerbsfähigkeit auf dem API-Markt",
  "station.competitive-analysis.how_it_works.1": "Identifizieren Sie Marktlücken, die Ihre APIs auf der Grundlage der Angebote der Wettbewerber füllen können.",
  "station.competitive-analysis.how_it_works.2": "Entwickeln Sie eine Differenzierungsstrategie, die die einzigartigen Merkmale und Vorteile Ihrer APIs hervorhebt.",
  "station.ecosystem-vision.outcomes.1": "APIs, die Zusammenarbeit und Integration ermöglichen",
  "station.ecosystem-vision.outcomes.2": "Identifizierung und Einbindung von Ökosystempartnern",
  "station.ecosystem-vision.outcomes.3": "APIs tragen zu einem lebendigen Ökosystem bei",
  "station.ecosystem-vision.how_it_works.1": "Identifizieren Sie die wichtigsten Ökosystempartner und -akteure, die von dem Ökosystem profitieren oder zu ihm beitragen werden.",
  "station.ecosystem-vision.how_it_works.2": "Entwicklung von APIs, die eine nahtlose Integration und Zusammenarbeit innerhalb des Ökosystems ermöglichen.",
  "station.scalable-infrastructure.outcomes.1": "Hohe Verfügbarkeit und Leistung unter Last",
  "station.scalable-infrastructure.outcomes.2": "Eine für künftiges Wachstum ausgelegte Infrastruktur",
  "station.scalable-infrastructure.outcomes.3": "Geringere Ausfallzeiten und verbesserte Benutzerfreundlichkeit",
  "station.scalable-infrastructure.how_it_works.1": "Implementierung von Lastausgleich, Caching und anderen Techniken, um hohe Verfügbarkeit und Leistung zu gewährleisten. Sammeln von Infrastrukturanforderungen von API-Teams mithilfe von Capacity Canvas",
  "station.scalable-infrastructure.how_it_works.2": "Überwachen Sie die Leistung und Kapazität der Infrastruktur, um sicherzustellen, dass sie die wachsende Nachfrage bewältigen kann.",
  "station.legal-and-compliance.outcomes.1": "Anforderungen an Datenschutz und Privatsphäre erfüllt",
  "station.legal-and-compliance.outcomes.2": "Ermittelte und abgemilderte rechtliche Risiken",
  "station.legal-and-compliance.outcomes.3": "Klare Dokumentation der Compliance-Maßnahmen",
  "station.legal-and-compliance.how_it_works.1": "Implementieren Sie Maßnahmen, die sicherstellen, dass APIs diese Anforderungen erfüllen, einschließlich Datenverschlüsselung, Zugriffskontrollen und Prüfpfade.",
  "station.legal-and-compliance.how_it_works.2": "Dokumentieren Sie die Maßnahmen zur Einhaltung der Vorschriften und stellen Sie sicher, dass sie den Beteiligten und Verbrauchern mitgeteilt werden.",
  "station.security-and-privacy.outcomes.1": "Schutz der Nutzerdaten durch Maßnahmen zum Schutz der Privatsphäre",
  "station.security-and-privacy.outcomes.2": "Bewährte Sicherheitspraktiken bei der Gestaltung und Entwicklung von APIs",
  "station.security-and-privacy.outcomes.3": "Einhaltung von Sicherheitsstandards und -vorschriften",
  "station.security-and-privacy.how_it_works.1": "Gewährleistung des Datenschutzes für die Nutzer durch die Umsetzung von Datenschutzmaßnahmen wie Anonymisierung und Zugangskontrolle.",
  "station.security-and-privacy.how_it_works.2": "Durchführung regelmäßiger Sicherheitsaudits und Schwachstellenbewertungen zur Ermittlung und Minderung von Risiken.",
  "station.design-standards.outcomes.1": "Hochwertige APIs, die den Bedürfnissen der Nutzer entsprechen",
  "station.design-standards.outcomes.2": "Wiederverwendbare Entwurfsmuster und Komponenten",
  "station.design-standards.outcomes.3": "Verringerung von Designinkonsistenzen und technischen Schulden",
  "station.design-standards.how_it_works.1": "Erstellen Sie wiederverwendbare Entwurfsmuster und Komponenten, die von Teams genutzt werden können, um Konsistenz und Qualität zu gewährleisten.",
  "station.design-standards.how_it_works.2": "Durchführung von Entwurfsprüfungen und Audits, um die Einhaltung von Entwurfsstandards zu gewährleisten und verbesserungswürdige Bereiche zu ermitteln.",
  "station.vendor-management.outcomes.1": "Zuverlässig und sicher integrierte APIs von Drittanbietern",
  "station.vendor-management.outcomes.2": "Einhaltung der Organisationsstandards durch den Lieferanten",
  "station.vendor-management.outcomes.3": "Geringere Risiken im Zusammenhang mit Abhängigkeiten von Dritten",
  "station.vendor-management.how_it_works.1": "Definieren Sie Kriterien für die Bewertung von Anbieter-APIs, einschließlich Zuverlässigkeit, Sicherheit und Compliance.",
  "station.vendor-management.how_it_works.2": "Überwachung der Leistung von Anbietern und der Einhaltung von Service Level Agreements (SLAs) und Organisationsstandards.",
  "station.contract-design.outcomes.1": "Umriss der Erwartungen und Verantwortlichkeiten von API-Anbietern und Verbrauchern",
  "station.contract-design.outcomes.2": "Dokumentierte Verwendungsrichtlinien und bewährte Verfahren",
  "station.contract-design.outcomes.3": "Weniger Missverständnisse und Streitigkeiten über die API-Nutzung",
  "station.contract-design.how_it_works.1": "Verwenden Sie standardisierte Formate (z. B. OpenAPI, AsyncAPI), um maschinenlesbare API-Verträge zu erstellen, die sich leicht austauschen und validieren lassen.",
  "station.contract-design.how_it_works.2": "Sicherstellen, dass die API-Verträge von den Beteiligten geprüft und genehmigt werden, um Übereinstimmung und Klarheit zu gewährleisten.",
  "station.development.outcomes.1": "Hochwertige, wartbare und skalierbare APIs",
  "station.development.outcomes.2": "Befolgung einheitlicher Kodierungsstandards und -praktiken",
  "station.development.outcomes.3": "Geringere Entwicklungszeit und weniger technische Schulden",
  "station.development.how_it_works.1": "Wenden Sie Contract-First- oder Design-First-Ansätze an, um sicherzustellen, dass API-Verträge vor der Implementierung validiert werden.",
  "station.development.how_it_works.2": "Befolgen Sie Kodierungsstandards und bewährte Verfahren, um eine konsistente und hochwertige API-Entwicklung zu gewährleisten.",
  "station.ci-cd.outcomes.1": "Konsistente Qualität und Rückverfolgbarkeit bei der API-Lieferung",
  "station.ci-cd.outcomes.2": "Schnellere Iterationen und kürzere Markteinführungszeiten",
  "station.ci-cd.outcomes.3": "Verbesserte Zusammenarbeit und Feedback-Schleifen bei der API-Entwicklung",
  "station.ci-cd.how_it_works.1": "Integrieren Sie funktionale und nicht-funktionale Tests in die CI/CD-Pipeline, um sicherzustellen, dass APIs den Qualitätsstandards entsprechen.",
  "station.ci-cd.how_it_works.2": "Implementieren Sie automatisierte Sicherheitsprüfungen und Compliance-Validierungen in der CI/CD-Pipeline, um sicherzustellen, dass APIs sicher und konform sind.",
  "station.test-automation.outcomes.1": "Automatisierte Funktions-, Sicherheits- und Leistungstests",
  "station.test-automation.outcomes.2": "Reduzierter manueller Testaufwand und erhöhte Testabdeckung",
  "station.test-automation.outcomes.3": "Verbesserte Zuverlässigkeit und Qualität der API",
  "station.test-automation.how_it_works.1": "Implementierung von Testautomatisierungs-Frameworks, die Vertragstests, Integrationstests und End-to-End-Tests unterstützen.",
  "station.test-automation.how_it_works.2": "Integrieren Sie automatisierte Tests in die CI/CD-Pipeline, um eine kontinuierliche Validierung der API-Qualität sicherzustellen.",
  "station.release-management.outcomes.1": "Festlegung von Versions- und Bereitstellungsstrategien",
  "station.release-management.outcomes.2": "Rollback-Verfahren für API-Releases eingeführt",
  "station.release-management.outcomes.3": "Geringere Risiken im Zusammenhang mit API-Änderungen",
  "station.release-management.how_it_works.1": "Implementierung von Bereitstellungsstrategien (z. B. blau-grüne Bereitstellungen, Canary-Releases) zur Minimierung der Risiken bei API-Releases.",
  "station.release-management.how_it_works.2": "Einführung von Rollback-Verfahren zur schnellen Rückgängigmachung von Änderungen im Falle von Problemen bei API-Releases.",
  "station.service-agreements.outcomes.1": "Erwartungen und Dienstleistungsniveaus für API-Anbieter und Verbraucher",
  "station.service-agreements.outcomes.2": "Zuständigkeiten und Unterstützungsprozesse dokumentiert",
  "station.service-agreements.outcomes.3": "Verbesserte Kommunikation und Zusammenarbeit zwischen API-Teams",
  "station.service-agreements.how_it_works.1": "Verwenden Sie standardisierte Formate, um maschinenlesbare Servicevereinbarungen zu erstellen, die sich leicht austauschen und validieren lassen.",
  "station.service-agreements.how_it_works.2": "Sicherstellen, dass die Dienstleistungsvereinbarungen von den Beteiligten überprüft und genehmigt werden, um die Übereinstimmung und Klarheit zu gewährleisten.",
  "station.api-consumer-adoption.outcomes.1": "Erhöhte API-Nutzung und Engagement",
  "station.api-consumer-adoption.outcomes.2": "API-Kunden werden über die Funktionen und Vorteile von APIs aufgeklärt",
  "station.api-consumer-adoption.outcomes.3": "Verbesserte Zufriedenheit und Loyalität der API-Kunden",
  "station.api-consumer-adoption.how_it_works.1": "Erstellung von Lehrmaterial (z. B. Tutorials, Dokumentation), das die Funktionen, Vorteile und Nutzungsmuster der API erläutert.",
  "station.api-consumer-adoption.how_it_works.2": "Engagieren Sie sich mit API-Benutzern über Feedbackschleifen, Support-Kanäle und Community-Foren, um ihre Bedürfnisse zu verstehen und die API-Akzeptanz zu verbessern.",
  "station.api-promotion.outcomes.1": "Erhöhte Sichtbarkeit und Bekanntheit von API",
  "station.api-promotion.outcomes.2": "Höhere API-Nutzungs- und Akzeptanzraten",
  "station.api-promotion.outcomes.3": "Verbesserte API-Kundenbindung und -zufriedenheit",
  "station.api-promotion.how_it_works.1": "Erstellen Sie Werbematerialien (z. B. Fallstudien, Erfolgsgeschichten), die den Wert und die Vorteile von APIs hervorheben.",
  "station.api-promotion.how_it_works.2": "Engagieren Sie sich in API-Gemeinschaften und Foren, um API-Aktualisierungen weiterzugeben, Feedback zu sammeln und die API-Nutzung zu fördern.",
  "station.partner-integration.outcomes.1": "Verbesserte API-Funktionen durch Partner-APIs",
  "station.partner-integration.outcomes.2": "Erhöhte Reichweite und Marktchancen durch Partnerschaften",
  "station.partner-integration.outcomes.3": "Verbesserte Zusammenarbeit und Innovation mit Partnern",
  "station.partner-integration.how_it_works.1": "Festlegung von Integrationsprozessen und Richtlinien für die Zusammenarbeit mit Partnern, einschließlich technischer Integration, Datenaustausch und Unterstützung.",
  "station.partner-integration.how_it_works.2": "Überwachen Sie die API-Leistung und -Einhaltung der Partner, um Zuverlässigkeit und Übereinstimmung mit Ihrer API-Strategie zu gewährleisten.",
  "station.api-mindset.outcomes.1": "Verbesserte Innovation und Zusammenarbeit durch APIs",
  "station.api-mindset.outcomes.2": "API-Teams, die in der Lage sind, die API-Strategie und -Initiativen voranzutreiben",
  "station.api-mindset.outcomes.3": "Verbesserte Abstimmung zwischen Geschäftszielen und API-Entwicklung",
  "station.api-mindset.how_it_works.1": "Fördern Sie die funktionsübergreifende Zusammenarbeit zwischen API-Teams, Geschäftseinheiten und Interessenvertretern, um API-Initiativen mit den Geschäftszielen abzustimmen.",
  "station.api-mindset.how_it_works.2": "Bereitstellung von Schulungen und Ressourcen, um Teams dabei zu helfen, eine API-first-Mentalität zu entwickeln und die Vorteile von APIs zu verstehen.",
  "station.roles-and-responsibilities.outcomes.1": "Effektive Zusammenarbeit und Verantwortlichkeit innerhalb der API-Teams",
  "station.roles-and-responsibilities.outcomes.2": "Verbesserte Kommunikation und Abstimmung zwischen den Teammitgliedern",
  "station.roles-and-responsibilities.outcomes.3": "Weniger Verwirrung und Überschneidungen bei den Zuständigkeiten",
  "station.roles-and-responsibilities.how_it_works.1": "Legen Sie klare Verantwortlichkeiten für jede Rolle fest, einschließlich API-Design, Entwicklung, Testen und Betrieb.",
  "station.roles-and-responsibilities.how_it_works.2": "Sicherstellen, dass die Rollen und Verantwortlichkeiten allen Teammitgliedern und Interessenvertretern mitgeteilt werden, um eine Abstimmung zu gewährleisten.",
  "station.upskilling.outcomes.1": "Erhöhte Kompetenz bei der Konzeption, Entwicklung und Verwaltung von APIs",
  "station.upskilling.outcomes.2": "Verbesserte Fähigkeit zur Übernahme neuer Technologien und Verfahren",
  "station.upskilling.outcomes.3": "Befähigte Teams zur Förderung von API-Innovation und -Qualität",
  "station.upskilling.how_it_works.1": "Bereitstellung von Schulungsprogrammen, Workshops und Ressourcen, um Teams bei der Verbesserung ihrer API-Fähigkeiten und -Kenntnisse zu unterstützen.",
  "station.upskilling.how_it_works.2": "Fördern Sie kontinuierliches Lernen durch Online-Kurse, Zertifizierungen und Engagement in der Gemeinschaft.",
  "station.operating-guidelines.outcomes.1": "Konsistente API-Verwaltung und -Qualität im gesamten Unternehmen",
  "station.operating-guidelines.outcomes.2": "Einhaltung von Organisationsstandards und bewährten Verfahren",
  "station.operating-guidelines.outcomes.3": "Verbesserte Sichtbarkeit und Kontrolle über API-Initiativen",
  "station.operating-guidelines.how_it_works.1": "Etablieren Sie Governance-Praktiken, die sicherstellen, dass APIs einheitlich verwaltet werden, einschließlich Überprüfungen, Audits und Compliance-Checks.",
  "station.operating-guidelines.how_it_works.2": "Überwachung von API-Initiativen, um die Einhaltung von Betriebsrichtlinien und Governance-Praktiken zu gewährleisten",
  "station.portfolio-management.outcomes.1": "APIs im Einklang mit Unternehmenszielen und strategischen Initiativen",
  "station.portfolio-management.outcomes.2": "Priorisierung und Optimierung von APIs auf der Grundlage von Wert und Wirkung",
  "station.portfolio-management.outcomes.3": "Verbesserte Sichtbarkeit und Kontrolle über das API-Portfolio",
  "station.portfolio-management.how_it_works.1": "Festlegung von Kriterien für die Bewertung und Priorisierung von APIs auf der Grundlage des Geschäftswerts, der Auswirkungen und der Ausrichtung auf strategische Initiativen.",
  "station.portfolio-management.how_it_works.2": "Überwachen Sie das API-Portfolio, um sicherzustellen, dass die APIs einen Mehrwert liefern, die Leistungserwartungen erfüllen und mit den Geschäftszielen übereinstimmen.",
  "station.budget-and-resource-management.outcomes.1": "Effiziente Zuweisung von Ressourcen für API-Initiativen",
  "station.budget-and-resource-management.outcomes.2": "Optimierte Investitionen in die API-Entwicklung und -Verwaltung",
  "station.budget-and-resource-management.outcomes.3": "Verbesserte finanzielle Transparenz und Kontrolle über API-Initiativen",
  "station.budget-and-resource-management.how_it_works.1": "Festlegung von Kriterien für die Bewertung und Priorisierung von Budgetzuweisungen auf der Grundlage des Geschäftswerts, der Auswirkungen und der Ausrichtung auf strategische Initiativen.",
  "station.budget-and-resource-management.how_it_works.2": "Überwachung des Budgets und der Ressourcennutzung, um effektive Investitionen und Ressourcenzuweisung für API-Initiativen sicherzustellen."
}
